{
  "lang": "ar",
  "language": "العربية",
  "header_nav_1": "محلل APK/IPA",
  "header_nav_2": "ترميز وفك ترميز Base64",
  "header_nav_3": "تحويل الصور إلى webp",
  "footer_nav_1": "من نحن",
  "footer_nav_2": "الأمان",
  "footer_nav_3": "الخصوصية",
  "footer_nav_4": "الشروط",
  "footer_nav_5": "اتصل بنا",
  "copyright": "جميع الحقوق محفوظة",
  "title": "محلل Apk عبر الإنترنت",
  "description": "باستخدام أداة Apk Analyzer Online، قم بتحليل وتحسين ملفات APK الخاصة بأندرويد لتحسين الأداء والوظائف بسهولة. احصل على رؤى وتوصيات مفصلة لتعزيز أداء التطبيق وتجربة المستخدم.",
  "keywords": "محلل apk, محلل apk عبر الإنترنت, تحليل apk عبر الإنترنت, أداة محلل apk, محلل الشبكة apk",
  "choose_files": "اختر الملفات",
  "choose_file_more": "أو اسحب وافلت ملف apk/ipa هنا",
  "index_desc_title_1": "الوظائف",
  "index_desc_text_1": "فحص شامل لمحتويات حزمة APK بما في ذلك كود التطبيق، ملفات الموارد، MANIFEST، المكتبات، الأذونات، توافق الأجهزة والمزيد.",
  "index_desc_title_2": "واجهة المستخدم",
  "index_desc_text_2": "لوحات تحكم نظيفة وبديهية لتحميل ملفات APK وتصفح البيانات الفنية والأذونات المستخرجة للفحص.",
  "index_desc_title_3": "الأمان",
  "index_desc_text_3": "يتم حماية الملفات بتشفير SSL ببت 256 ويتم حذفها تلقائيًا بعد ساعتين لضمان السرية.",
  "index_desc_title_4": "التكلفة",
  "index_desc_text_4": "خدمة مجانية 100٪ مع تحميلات APK غير محدودة وتخزين البيانات. يتكفل مجتمع المصدر المفتوح بتكاليف الخادم والتخزين.",
  "index_apk_title": "APK (حزمة تطبيقات أندرويد)",
  "index_apk_desc": "APK (حزمة تطبيقات أندرويد) هو تنسيق الملفات المستخدم لتوزيع وتثبيت التطبيقات على أجهزة أندرويد. يحتوي على جميع الملفات والموارد اللازمة لتشغيل التطبيق على منصة أندرويد. يتضمن ملف APK كود التطبيق، الأصول، ملف البيان والشهادات. يتيح للمستخدمين تنزيل التطبيقات وتثبيتها بسهولة من مصادر متنوعة. تستخدم ملفات APK بشكل رئيسي على أجهزة أندرويد ويمكن تثبيتها مباشرة أو عبر متاجر التطبيقات مثل Google Play.",
  "index_ipa_title": "IPA (حزمة متجر تطبيقات iOS)",
  "index_ipa_desc": "IPA (حزمة متجر تطبيقات iOS) هو تنسيق الملفات المستخدم لتوزيع وتثبيت التطبيقات على أجهزة iOS. يحتوي على الكود الثنائي المجمع والموارد والبيانات الوصفية اللازمة لتشغيل التطبيق على iPhone أو iPad أو iPod Touch. يتم إنشاء ملف IPA عندما يتم تجميع التطبيق الخاص بنظام iOS وتوقيعه من قبل المطور. يمكن تثبيته على أجهزة iOS عبر iTunes أو طرق التثبيت عبر الأثير مثل TestFlight من Apple. ملفات IPA مخصصة لأجهزة iOS ويمكن تثبيتها فقط على الأجهزة التي تعمل بنظام iOS.",
  "base64_title": "ترميز وفك ترميز Base64",
  "base64_keywords": "base64 إلى ملف, ملف إلى base64, تحويل الملف إلى base64, فك ترميز base64 إلى ملف, تحويل base64 إلى ملف عبر الإنترنت",
  "base64_description": "قم بترميز وفك ترميز البيانات إلى ومن صيغة Base64 باستخدام أداة الإنترنت الخاصة بنا. تحويل النصوص أو الصور أو الملفات إلى Base64 لنقل أو تخزين البيانات بشكل آمن. فك ترميز سلاسل Base64 إلى شكلها الأصلي.",
  "base64_encode": "ترميز Base64",
  "base64_decode": "فك ترميز Base64",
  "base64_select_text": "اختر النوع",
  "base64_select_text_2": "اختر امتداد الملف",
  "base64_encode_input_placeholder": "أدخل سلسلة Base64 المفككة",
  "base64_encode_result_placeholder": "اعثر على النتيجة هنا...",
  "base64_encode_btn": "ترميز",
  "base64_decode_input_placeholder": "أدخل سلسلة Base64 المشفرة",
  "base64_decode_result_placeholder": "اعثر على النتيجة هنا...",
  "base64_decode_btn": "فك الترميز",
  "base64_choose_files": "اختر الملفات",
  "base64_choose_file_more": "أو اسحب وافلت الملف هنا",
  "base64_result": "ستظهر نتيجة ترميز Base64 هنا",
  "base64_copy": "نسخ",
  "base64_clear": "مسح",
  "base64_download": "تنزيل",
  "base64_desc_text_1": "Base64 هو نظام تحويل ثنائي إلى نصي يقوم بتحويل البيانات الثنائية إلى صيغة آمنة للنقل عبر البروتوكولات النصية مثل البريد الإلكتروني أو HTTP. يحقق ذلك عن طريق تمثيل البيانات الثنائية باستخدام مجموعة من 64 حرف ASCII القابلة للطباعة.",
  "base64_desc_text_2": "التشفير باستخدام Base64",
  "base64_desc_text_3": "يتم تقسيم البيانات المدخلة إلى مجموعات من ثلاث بايتات (24 بت) لكل منها.",
  "base64_desc_text_4": "ثم يتم تقسيم كل مجموعة إلى أربعة قطع ب 6 بت لكل منها.",
  "base64_desc_text_5": "يتم استخدام القيمة العشرية لكل قطعة ب 6 بت كفهرس في جدول البحث الذي يحتوي على الأحرف الـ 64 المستخدمة في ترميز Base64.",
  "base64_desc_text_6": "يتم أخذ الحرف المقابل لكل فهرس وتجميعه معًا، مما ينتج عنه سلسلة من الأحرف المشفرة بـ Base64.",
  "base64_desc_text_7": "إذا لم يكن طول البيانات المدخلة من مضاعفات الثلاثة، تتم إضافة حروف تعبئة ('=') إلى النهاية لجعل الطول الإجمالي مضاعفًا للأربعة.",
  "base64_desc_text_8": "فك التشفير باستخدام Base64",
  "base64_desc_text_9": "يتم تقسيم السلسلة المشفرة بـ Base64 إلى مجموعات من أربعة أحرف.",
  "base64_desc_text_10": "يتم تحويل كل حرف مرة أخرى إلى تمثيله الثنائي بـ 6 بت باستخدام جدول البحث.",
  "base64_desc_text_11": "يتم تجميع القطع بـ 6 بت الناتجة لتشكيل ثلاث بايتات (24 بت).",
  "base64_desc_text_12": "إذا كانت هناك حروف تعبئة ('=')، يتم تجاهلها أثناء عملية فك التشفير.",
  "base64_desc_text_13": "النتيجة النهائية هي البيانات الثنائية المفككة.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "تحويل الصور إلى WebP",
  "webp_keywords": "تحويل الصورة إلى webp, تحويل الصور إلى webp, تحويل jpg إلى webp, تحويل gif إلى webp, تحويل png إلى webp, تحويل jpeg إلى webp, تحويل svg إلى webp, تحويل ico إلى webp, تحويل bmp إلى webp",
  "webp_description": "تحويل الصور إلى WebP بسهولة لأداء ويب أسرع وعالي الجودة. مثالي للمطورين ومصممي الويب!",
  "webp_choose_files": "اختر الملفات",
  "webp_choose_files_more": "أو اسحب وافلت .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp هنا",
  "webp_download": "تنزيل Webp",
  "webp_desc_title_1": "JPG إلى WebP",
  "webp_desc_text_1": "قم بتحويل صور .jpg إلى صيغة WebP الحديثة بسهولة. قم بتحسين حجم الصورة والحفاظ على الجودة باستخدام أداتنا عبر الإنترنت. ابدأ الآن بتحويل ملفات .jpg إلى WebP!",
  "webp_desc_title_2": "GIF إلى WebP",
  "webp_desc_text_2": "قم بتحويل ملفات .gif إلى صيغة WebP بسهولة لتحسين أداء الويب. قلل من حجم الملف دون المساس بجودة الرسوم المتحركة. قم بتحويل .gif إلى WebP وحسن تجربتك على الويب!",
  "webp_desc_title_3": "PNG إلى WebP",
  "webp_desc_text_3": "قم بتحويل صور .png إلى صيغة WebP الفعالة بسهولة. حافظ على الشفافية وقلل من حجم الملف لتحميل أسرع. ابدأ الآن بتحويل ملفات .png إلى WebP!",
  "webp_desc_title_4": "JPEG إلى WebP",
  "webp_desc_text_4": "جرب أداء ويب أسرع من خلال تحويل ملفات .jpeg إلى صيغة WebP. حافظ على جودة الصورة مع تقليل حجم الملف. قم بتحويل .jpeg إلى WebP وزيادة سرعة موقع الويب الخاص بك!",
  "webp_desc_title_5": "SVG إلى WebP",
  "webp_desc_text_5": "قم بتحويل ملفات .svg إلى صيغة WebP بسهولة. استمتع بأحجام ملفات أصغر وتحسين التوافق مع الويب. ابدأ الآن بتحويل ملفات .svg إلى WebP وحسن تجربتك على الويب!",
  "webp_desc_title_6": "ICO إلى WebP",
  "webp_desc_text_6": "قم بتحسين موقع الويب الخاص بك عن طريق تحويل ملفات .ico إلى صيغة WebP الفعالة. قلل من حجم الملف دون المساس بجودة الأيقونات. قم بتحويل .ico إلى WebP الآن وحسن أداء موقعك!",
  "webp_desc_title_7": "BMP إلى WebP",
  "webp_desc_text_7": "قم بتحويل صور .bmp إلى صيغة WebP الحديثة بسهولة. استمتع بأحجام ملفات أصغر وأوقات تحميل أسرع. ابدأ الآن بتحويل ملفات .bmp إلى WebP وقم بتحسين محتوى الويب الخاص بك!",
  "info_size": "MB",
  "info_date": "تاريخ التحميل",
  "info_title_1": "اسم الحزمة",
  "info_title_2": "رمز الإصدار",
  "info_title_3": "اسم الإصدار",
  "info_title_4": "دعم ABIs",
  "info_title_5": "المكتبات الأصلية",
  "info_title_6": "أدنى إصدار أندرويد مدعوم",
  "info_title_7": "SDK المستهدف",
  "info_title_8": "الأنشطة",
  "info_title_9": "الخدمات",
  "info_title_10": "مستقبلات البث",
  "info_title_11": "مقدمو المحتوى",
  "info_title_12": "الأذونات المطلوبة",
  "info_title_13": "معرف الحزمة",
  "info_title_14": "إصدار الحزمة",
  "info_title_15": "أدنى إصدار لنظام التشغيل",
  "info_title_16": "وصف استخدام الكاميرا",
  "info_title_17": "وصف استخدام الميكروفون",
  "info_title_18": "المنصات المدعومة",
  "info_title_19": "عائلة الأجهزة",
  "info_title_20": "القدرات المطلوبة",
  "info_title_21": "الاتجاهات المدعومة",
  "info_title_22": "الاتجاهات المدعومة لأجهزة iPad",
  "info_title_23": "تاريخ إنشاء التصريح المحمول",
  "info_title_24": "اسم الفريق",
  "info_title_25": "نقاط النهاية URL",
  "info_title_26": "نقاط النهاية IP",
  "info_tip_1": "هذه هي نقاط الدخول للتفاعل مع المستخدم. يمثل كل نشاط شاشة واحدة بواجهة مستخدم.",
  "info_tip_2": "هي مكونات تعمل في الخلفية لتنفيذ عمليات طويلة الأمد أو أداء عمل للعمليات البعيدة.",
  "info_tip_3": "هذه مكونات تستجيب للإعلانات الإذاعية على مستوى النظام. لا تعرض واجهة مستخدم ولكن يمكنها إنشاء إشعار في شريط الحالة.",
  "info_tip_4": "تدير مجموعة مشتركة من بيانات التطبيق التي يمكنك تخزينها في نظام الملفات أو قاعدة بيانات SQLite أو على الويب أو في أي موقع تخزين دائم آخر يمكن لتطبيقك الوصول إليه.",
  "info_tip_5": "تسرد هذه الأذونات التي يطلبها التطبيق للوصول إلى البيانات الحساسة أو ميزات النظام. تشمل الأمثلة الوصول إلى الكاميرا وجهات الاتصال والموقع وما إلى ذلك.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "لا توجد بيانات",
  "not_found": "لم يتم العثور على هذه الصفحة.",
  "header_nav_4": "مفكك الشيفرة Java",
  "java_title": "مفكك الشيفرة Java عبر الإنترنت",
  "java_description": "قم بتحسين تطبيقات Java الخاصة بك باستخدام مفكك الشيفرة Java عبر الإنترنت. حلل وفك شفرة الكود لتحسين الأداء واكتساب رؤى لتحسين تجربة المستخدم وتبسيط التطوير.",
  "java_keywords": "مفكك الشيفرة java, مفكك الشيفرة java عبر الإنترنت, مفكك الشيفرة apk, مفكك الشيفرة apk عبر الإنترنت, مفكك الشيفرة jar عبر الإنترنت, مفكك الشيفرة java class",
  "java_choose_files": "اختر الملفات",
  "java_choose_files_more": "أو اسحب وافلت apk/jar/class هنا",
  "java_faq": "الأسئلة الشائعة",
  "java_faq_desc": "اعثر على إجابات لأكثر الأسئلة شيوعًا أدناه",
  "java_faq_title_1": "كيف يعمل مفكك الشيفرة Java عبر الإنترنت؟",
  "java_faq_text_1": "مفكك الشيفرة Java عبر الإنترنت يبسط العملية - فقط اسحب وافلت ملفات Java class للحصول على فك شيفرة فوري. توقع الحصول على نتائج عالية الجودة دون أي متاعب.",
  "java_faq_title_2": "هل عملية فك الشيفرة آمنة؟",
  "java_faq_text_2": "كن مطمئنًا، مفكك الشيفرة Java عبر الإنترنت يعطي الأولوية لخصوصيتك. يتم تخزين الملفات مؤقتًا لفك الشيفرة ثم حذفها بسرعة، مما يضمن بقاء بياناتك آمنة في جميع الأوقات.",
  "java_faq_title_3": "ما هي المنصات التي يدعمها مفكك الشيفرة Java؟",
  "java_faq_text_3": "يعمل مفكك الشيفرة Java عبر الإنترنت على جميع المنصات، بما في ذلك Mac وLinux وUbuntu وإصدارات Windows المختلفة. استمتع بفك الشيفرة بسلاسة بغض النظر عن نظام التشغيل الخاص بك.",
  "java_faq_title_4": "هل عملية فك الشيفرة سهلة الاستخدام؟",
  "java_faq_text_4": "مفكك الشيفرة Java عبر الإنترنت يوفر أسهل تجربة فك شيفرة Java على الويب، مما يلغي أي منحنى تعلم. استمتع بفك الشيفرة دون مجهود مع بضع نقرات فقط.",
  "java_faq_title_5": "هل تتطلب عملية فك الشيفرة أي تثبيتات؟",
  "java_faq_text_5": "لا تتطلب أي تثبيتات. يستخدم مفكك الشيفرة Java عبر الإنترنت تقنية السحابة لفك الشيفرة بسرعة، مما يضمن تجربة خالية من المتاعب بدون أي تثبيتات محلية.",
  "java_faq_title_6": "هل يمكنني استخراج محتويات Jar بسرعة باستخدام هذه المنصة؟",
  "java_faq_text_6": "بالتأكيد. ميزة استخراج Jar في مفكك الشيفرة Java عبر الإنترنت تستخدم تقنية السحابة لاستخراج سريع. استمتع باستخراج محتويات Jar بسرعة وكفاءة دون الحاجة إلى تثبيتات إضافية.",
  "java_notice": "نظرًا لحجم الملف، قد تستغرق عملية التحميل من 3 إلى 5 دقائق. شكرًا لصبرك."
}
