{
  "lang": "de",
  "language": "Deutsch",
  "header_nav_1": "APK/IPA-Analysator",
  "header_nav_2": "Base64-Codierung und -Decodierung",
  "header_nav_3": "Bild zu webp",
  "footer_nav_1": "Über uns",
  "footer_nav_2": "Sicherheit",
  "footer_nav_3": "Datenschutz",
  "footer_nav_4": "Nutzungsbedingungen",
  "footer_nav_5": "Kontakt",
  "copyright": "Alle Rechte vorbehalten",
  "title": "Apk-Analysator Online",
  "description": "Mit unserem Apk-Analysator Online-Tool können Sie Ihre Android-APKs einfach analysieren und optimieren, um die Leistung und Funktionalität zu verbessern. Erhalten Sie detaillierte Einblicke und Empfehlungen zur Verbesserung der Leistung und Benutzererfahrung Ihrer App.",
  "keywords": "apk-analysator, apk-analysator online, apk online analysieren, apk-analysator tool, netzwerk-analysator apk",
  "choose_files": "Dateien auswählen",
  "choose_file_more": "oder ziehen Sie Ihre apk/ipa hierher",
  "index_desc_title_1": "Funktionalität",
  "index_desc_text_1": "Umfassende Inspektion des APK-Paketinhalts, einschließlich App-Code, Ressourcendateien, MANIFEST, Bibliotheken, Berechtigungen, Hardware-Kompatibilität und mehr.",
  "index_desc_title_2": "Benutzeroberfläche",
  "index_desc_text_2": "Saubere, intuitive Dashboards zum Hochladen von APKs und Navigieren durch extrahierte technische und Berechtigungsdaten zur Inspektion.",
  "index_desc_title_3": "Sicherheit",
  "index_desc_text_3": "Dateien werden mit 256-Bit-SSL-Verschlüsselung geschützt und nach 2 Stunden automatisch gelöscht, um Vertraulichkeit zu gewährleisten.",
  "index_desc_title_4": "Kosten",
  "index_desc_text_4": "100% kostenloser Service mit unbegrenzten APK-Uploads und Datenspeicherung. Unsere Open-Source-Community übernimmt die Server- und Speicherkosten.",
  "index_apk_title": "APK (Android Application Package)",
  "index_apk_desc": "APK (Android Application Package) ist das Dateiformat, das für die Verteilung und Installation von Anwendungen auf Android-Geräten verwendet wird. Es enthält alle notwendigen Dateien und Ressourcen, die erforderlich sind, damit die App auf einer Android-Plattform ausgeführt werden kann. Eine APK-Datei enthält den Code der App, Assets, die Manifest-Datei und Zertifikate. Es ermöglicht Benutzern, Apps einfach aus verschiedenen Quellen herunterzuladen und zu installieren. APK-Dateien werden hauptsächlich auf Android-Geräten verwendet und können direkt oder über App-Stores wie Google Play installiert werden.",
  "index_ipa_title": "IPA (iOS App Store Package)",
  "index_ipa_desc": "IPA (iOS App Store Package) ist das Dateiformat, das für die Verteilung und Installation von Anwendungen auf iOS-Geräten verwendet wird. Es enthält den kompilierten Binärcode, Ressourcen und Metadaten, die erforderlich sind, damit die App auf einem iPhone, iPad oder iPod Touch ausgeführt werden kann. Eine IPA-Datei wird erstellt, wenn eine iOS-App kompiliert und vom Entwickler signiert wird. Sie kann über iTunes oder über drahtlose Installationsmethoden wie Apple's TestFlight auf iOS-Geräten installiert werden. IPA-Dateien sind spezifisch für iOS-Geräte und können nur auf Geräten installiert werden, die iOS ausführen.",
  "base64_title": "Base64-Codierung und -Decodierung",
  "base64_keywords": "base64 zu datei, datei zu base64, datei in base64 konvertieren, base64 in datei decodieren, base64 zu datei online",
  "base64_description": "Codieren und decodieren Sie Daten einfach in das und aus dem Base64-Format mit unserem Online-Tool. Konvertieren Sie Texte, Bilder oder Dateien in Base64 für sichere Datenübertragung oder -speicherung. Decodieren Sie Base64-Zeichenketten zurück in ihr ursprüngliches Format.",
  "base64_encode": "Base64-Codierung",
  "base64_decode": "Base64-Decodierung",
  "base64_select_text": "Typ auswählen",
  "base64_select_text_2": "Erweiterung der Datei auswählen",
  "base64_encode_input_placeholder": "Base64-codierte Zeichenkette eingeben",
  "base64_encode_result_placeholder": "Ergebnis hier finden...",
  "base64_encode_btn": "Codieren",
  "base64_decode_input_placeholder": "Base64-codierte Zeichenkette eingeben",
  "base64_decode_result_placeholder": "Ergebnis hier finden...",
  "base64_decode_btn": "Decodieren",
  "base64_choose_files": "Dateien auswählen",
  "base64_choose_file_more": "oder Datei hierher ziehen",
  "base64_result": "Das Ergebnis der Base64-Codierung wird hier angezeigt",
  "base64_copy": "kopieren",
  "base64_clear": "löschen",
  "base64_download": "herunterladen",
  "base64_desc_text_1": "Base64 ist ein Binär-zu-Text-Codierungsschema, das Binärdaten in ein Format umwandelt, das für die Übertragung über textbasierte Protokolle wie E-Mail oder HTTP sicher ist. Es erreicht dies, indem es Binärdaten mit einem Satz von 64 druckbaren ASCII-Zeichen darstellt.",
  "base64_desc_text_2": "Codierung mit Base64",
  "base64_desc_text_3": "Die Eingabedaten werden in Gruppen von jeweils drei Bytes (24 Bits) unterteilt.",
  "base64_desc_text_4": "Jede Gruppe wird dann in vier 6-Bit-Stücke aufgeteilt.",
  "base64_desc_text_5": "Der Dezimalwert jedes 6-Bit-Stücks wird als Index in einer Nachschlagetabelle verwendet, die die 64 Zeichen enthält, die in der Base64-Codierung verwendet werden.",
  "base64_desc_text_6": "Das entsprechende Zeichen für jeden Index wird genommen und zusammengefügt, was zu einer Zeichenkette von Base64-codierten Zeichen führt.",
  "base64_desc_text_7": "Wenn die Eingabedaten nicht durch drei teilbar sind, werden Füllzeichen ('=') am Ende hinzugefügt, um die Gesamtlänge auf ein Vielfaches von vier zu bringen.",
  "base64_desc_text_8": "Decodierung mit Base64",
  "base64_desc_text_9": "Die Base64-codierte Zeichenkette wird in Gruppen von jeweils vier Zeichen unterteilt.",
  "base64_desc_text_10": "Jedes Zeichen wird mithilfe der Nachschlagetabelle in seine 6-Bit-Binärdarstellung zurückverwandelt.",
  "base64_desc_text_11": "Die resultierenden vier 6-Bit-Stücke werden kombiniert, um drei Bytes (24 Bits) zu bilden.",
  "base64_desc_text_12": "Wenn Füllzeichen ('=') vorhanden sind, werden sie während des Decodierungsprozesses ignoriert.",
  "base64_desc_text_13": "Das Endergebnis sind die decodierten Binärdaten.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Bilder zu WebP",
  "webp_keywords": "bild zu webp konvertieren, bilder zu webp konvertieren, jpg zu webp konvertieren, gif zu webp konvertieren, png zu webp konvertieren, jpeg zu webp konvertieren, svg zu webp konvertieren, ico zu webp konvertieren, bmp zu webp konvertieren",
  "webp_description": "Konvertieren Sie Bilder mühelos in WebP für schnellere, hochwertige Web-Leistung. Ideal für Entwickler und Webdesigner!",
  "webp_choose_files": "Dateien auswählen",
  "webp_choose_files_more": "oder ziehen und ablegen .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp",
  "webp_download": "Webp herunterladen",
  "webp_desc_title_1": "JPG zu WebP",
  "webp_desc_text_1": "Konvertieren Sie Ihre .jpg-Bilder mühelos in das moderne WebP-Format. Optimieren Sie die Bildgröße und erhalten Sie die Qualität mit unserem Online-Tool. Beginnen Sie jetzt mit der Konvertierung von .jpg-Dateien in WebP!",
  "webp_desc_title_2": "GIF zu WebP",
  "webp_desc_text_2": "Konvertieren Sie Ihre .gif-Dateien mühelos in das WebP-Format für optimierte Web-Leistung. Reduzieren Sie die Dateigröße, ohne die Animationsqualität zu beeinträchtigen. Konvertieren Sie .gif zu WebP und verbessern Sie Ihr Web-Erlebnis!",
  "webp_desc_title_3": "PNG zu WebP",
  "webp_desc_text_3": "Konvertieren Sie Ihre .png-Bilder mühelos in das effiziente WebP-Format. Erhalten Sie die Transparenz und reduzieren Sie die Dateigröße für schnellere Ladezeiten. Beginnen Sie jetzt mit der Konvertierung von .png-Dateien in WebP!",
  "webp_desc_title_4": "JPEG zu WebP",
  "webp_desc_text_4": "Erleben Sie schnellere Web-Leistung, indem Sie Ihre .jpeg-Dateien in das WebP-Format konvertieren. Erhalten Sie die Bildqualität, während Sie die Dateigröße reduzieren. Konvertieren Sie .jpeg zu WebP und steigern Sie die Geschwindigkeit Ihrer Website!",
  "webp_desc_title_5": "SVG zu WebP",
  "webp_desc_text_5": "Verwandeln Sie Ihre .svg-Dateien mühelos in das WebP-Format. Genießen Sie kleinere Dateigrößen und verbesserte Web-Kompatibilität. Beginnen Sie jetzt mit der Konvertierung von .svg-Dateien in WebP und verbessern Sie Ihr Web-Erlebnis!",
  "webp_desc_title_6": "ICO zu WebP",
  "webp_desc_text_6": "Optimieren Sie Ihre Website, indem Sie .ico-Dateien in das effiziente WebP-Format konvertieren. Reduzieren Sie die Dateigröße, ohne die Icon-Qualität zu beeinträchtigen. Konvertieren Sie .ico zu WebP und verbessern Sie die Leistung Ihrer Website!",
  "webp_desc_title_7": "BMP zu WebP",
  "webp_desc_text_7": "Konvertieren Sie Ihre .bmp-Bilder mühelos in das moderne WebP-Format. Genießen Sie kleinere Dateigrößen und schnellere Ladezeiten. Beginnen Sie jetzt mit der Konvertierung von .bmp-Dateien in WebP und optimieren Sie Ihre Web-Inhalte!",
  "info_size": "MB",
  "info_date": "Upload-Datum",
  "info_title_1": "Paketname",
  "info_title_2": "Versionscode",
  "info_title_3": "Versionsname",
  "info_title_4": "Unterstützte ABIs",
  "info_title_5": "Native Bibliotheken",
  "info_title_6": "Minimale unterstützte Android-Version",
  "info_title_7": "Ziel-SDK",
  "info_title_8": "Aktivitäten",
  "info_title_9": "Dienste",
  "info_title_10": "Broadcast-Empfänger",
  "info_title_11": "Inhaltsanbieter",
  "info_title_12": "Angeforderte Berechtigungen",
  "info_title_13": "Bundle-Kennung",
  "info_title_14": "Bundle-Version",
  "info_title_15": "Minimale Betriebssystemversion",
  "info_title_16": "Beschreibung der Kameranutzung",
  "info_title_17": "Beschreibung der Mikrofonnutzung",
  "info_title_18": "Unterstützte Plattformen",
  "info_title_19": "Gerätefamilie",
  "info_title_20": "Erforderliche Fähigkeiten",
  "info_title_21": "Unterstützte Ausrichtungen",
  "info_title_22": "Unterstützte iPad-Ausrichtungen",
  "info_title_23": "Erstellungsdatum der mobilen Bereitstellung",
  "info_title_24": "Teamname",
  "info_title_25": "URL-Endpunkte",
  "info_title_26": "IP-Endpunkte",
  "info_tip_1": "Dies sind die Einstiegspunkte für die Interaktion mit dem Benutzer. Jede Aktivität stellt einen einzelnen Bildschirm mit einer Benutzeroberfläche dar.",
  "info_tip_2": "Dies sind Komponenten, die im Hintergrund laufen, um lang andauernde Operationen auszuführen oder Arbeit für entfernte Prozesse zu erledigen.",
  "info_tip_3": "Dies sind Komponenten, die auf systemweite Broadcast-Ankündigungen reagieren. Sie zeigen keine Benutzeroberfläche an, können aber eine Benachrichtigung in der Statusleiste erstellen.",
  "info_tip_4": "Diese verwalten einen gemeinsamen Satz von Anwendungsdaten, die Sie im Dateisystem, in einer SQLite-Datenbank, im Web oder an einem anderen dauerhaften Speicherort speichern können, auf den Ihre App zugreifen kann.",
  "info_tip_5": "Dies listet die Berechtigungen auf, die die Anwendung anfordert, um auf sensible Daten oder Systemfunktionen zuzugreifen. Beispiele sind der Zugriff auf die Kamera, Kontakte, Standort usw.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Keine Daten",
  "not_found": "Diese Seite konnte nicht gefunden werden.",
  "header_nav_4": "Java-Dekompilierer",
  "java_title": "Java-Dekompilierer Online",
  "java_description": "Optimieren Sie Ihre Java-Apps mit dem Java-Dekompilierer Online. Analysieren, dekompilieren und verbessern Sie den Code, um die Leistung zu steigern und Einblicke für eine bessere Benutzererfahrung und eine optimierte Entwicklung zu gewinnen.",
  "java_keywords": "java dekompilierer, java dekompilierer online, apk dekompilierer, dekompilierte apk online, jar dekompilierer online, java class dekompilierer",
  "java_choose_files": "Dateien auswählen",
  "java_choose_files_more": "oder apk/jar/class hierher ziehen",
  "java_faq": "FAQ",
  "java_faq_desc": "Finden Sie unten die Antworten auf die häufigsten Fragen",
  "java_faq_title_1": "Wie funktioniert der Java-Dekompilierer Online?",
  "java_faq_text_1": "Der Java-Dekompilierer Online vereinfacht den Prozess - ziehen Sie einfach Ihre Java-Klassendateien per Drag & Drop für eine sofortige Dekompilierung. Erwarten Sie qualitativ hochwertige Ergebnisse ohne Aufwand.",
  "java_faq_title_2": "Ist der Dekompilierungsprozess sicher?",
  "java_faq_text_2": "Seien Sie versichert, der Java-Dekompilierer Online priorisiert Ihre Privatsphäre. Dateien werden kurzzeitig zur Dekompilierung gespeichert und schnell gelöscht, um sicherzustellen, dass Ihre Daten jederzeit sicher bleiben.",
  "java_faq_title_3": "Welche Plattformen unterstützt der Java-Dekompilierer?",
  "java_faq_text_3": "Der Java-Dekompilierer Online funktioniert auf allen Plattformen, einschließlich Mac, Linux, Ubuntu und verschiedenen Windows-Versionen. Genießen Sie eine nahtlose Dekompilierung, unabhängig von Ihrem Betriebssystem.",
  "java_faq_title_4": "Ist der Dekompilierungsprozess benutzerfreundlich?",
  "java_faq_text_4": "Der Java-Dekompilierer Online bietet die einfachste Java-Dekompilierungserfahrung im Web und eliminiert jede Lernkurve. Genießen Sie mühelose Dekompilierung mit nur wenigen Klicks.",
  "java_faq_title_5": "Erfordert der Dekompilierungsprozess Installationen?",
  "java_faq_text_5": "Es sind keine Installationen erforderlich. Der Java-Dekompilierer Online nutzt Cloud-Technologie für schnelle Dekompilierung und gewährleistet eine problemlose Erfahrung ohne lokale Installationen.",
  "java_faq_title_6": "Kann ich schnell Jar-Inhalte mit dieser Plattform extrahieren?",
  "java_faq_text_6": "Absolut. Die Jar-Extraktionsfunktion des Java-Dekompilierers Online nutzt Cloud-Technologie für schnelle Extraktion. Genießen Sie schnelle und effiziente Jar-Inhaltsextraktion ohne zusätzliche Installationen.",
  "java_notice": "Aufgrund der Dateigröße kann der Upload-Vorgang 3 bis 5 Minuten dauern. Vielen Dank für Ihre Geduld."
}