{
    "lang": "en",
    "language": "English",
    "header_nav_1": "APK/IPA Analyzer",
    "header_nav_2": "Base64 Encoding and Decoding",
    "header_nav_3": "Image to webp",
    "footer_nav_1": "About Us",
    "footer_nav_2": "Security",
    "footer_nav_3": "Privacy",
    "footer_nav_4": "Terms",
    "footer_nav_5": "Contact Us",
    "copyright": "All Rights Reserved",
    "title": "Apk Analyzer Online",
    "description": "With our Apk Analyzer Online tool, easily analyze and optimize your Android APKs for improved performance and functionality. Get detailed insights and recommendations to enhance your app's performance and user experience.",
    "keywords": "apk analyzer, apk analyzer online, analyze apk online, apk analyzer tool, network analyzer apk",
    "choose_files": "Choose Files",
    "choose_file_more": "or drop your apk/ipa here",
    "index_desc_title_1": "Functionality",
    "index_desc_text_1": "Comprehensively inspect APK package contents including app code, resource files, MANIFEST, libraries, permissions, hardware compatibility, and more.",
    "index_desc_title_2": "User Interface",
    "index_desc_text_2": "Clean, intuitive dashboards for uploading APKs and navigating extracted technical and permission data for inspection.",
    "index_desc_title_3": "Security",
    "index_desc_text_3": "Files are protected with 256-bit SSL encryption and automatically deleted after 2 hours to ensure confidentiality. ",
    "index_desc_title_4": "Cost",
    "index_desc_text_4": "100% free service with unlimited APK uploads and data storage. Our open source community sponsors server and storage costs.",
    "index_apk_title": "APK (Android Application Package)",
    "index_apk_desc": "APK (Android Application Package) is the file format used for distributing and installing applications on Android devices. It contains all the necessary files and resources required for the app to run on an Android platform. An APK file includes the app's code, assets, manifest file, and certificates. It allows users to easily download and install apps from various sources. APK files are primarily used for Android devices and can be installed directly or through app stores like Google Play.",
    "index_ipa_title": "IPA (iOS App Store Package)",
    "index_ipa_desc": "IPA (iOS App Store Package) is the file format used for distributing and installing applications on iOS devices. It contains the compiled binary code, resources, and metadata required for the app to run on an iPhone, iPad, or iPod Touch. An IPA file is created when an iOS app is compiled and signed by the developer. It can be installed on iOS devices via iTunes or through over-the-air installation methods like Apple's TestFlight. IPA files are specific to iOS devices and can only be installed on devices running iOS.",
    "base64_title": "Base64 Encoding and Decoding",
    "base64_keywords": "base64 to file, file to base64, convert file to base64, base64 decode to file, base64 to file online",
    "base64_description": "Easily encode and decode data to and from Base64 format with our online tool. Convert text, images, or files to Base64 for secure data transmission or storage. Decode Base64 strings back to their original format.",
    "base64_encode": "Base64 Encode",
    "base64_decode": "Base64 Decode",
    "base64_select_text": "Select the type",
    "base64_select_text_2": "Select the extension of the file",
    "base64_encode_input_placeholder": "Input Base64 decoded string",
    "base64_encode_result_placeholder": "Find the result here...",
    "base64_encode_btn": "Encode",
    "base64_decode_input_placeholder": "Input Base64 encoded string",
    "base64_decode_result_placeholder": "Find the result here...",
    "base64_decode_btn": "Decode",
    "base64_choose_files": "Choose Files",
    "base64_choose_file_more": "or drop your file here",
    "base64_result": "The result of Base64 encoding will appear here",
    "base64_copy": "copy",
    "base64_clear": "clear",
    "base64_download": "download",
    "base64_desc_text_1": "Base64 is a binary-to-text encoding scheme that converts binary data into a format that is safe for transmission over text-based protocols, such as email or HTTP. It achieves this by representing binary data using a set of 64 printable ASCII characters.",
    "base64_desc_text_2": "Encoding with Base64",
    "base64_desc_text_3": "The input data is divided into groups of three bytes (24 bits) each.",
    "base64_desc_text_4": "Each group is then split into four 6-bit chunks.",
    "base64_desc_text_5": "The decimal value of each 6-bit chunk is used as an index into a lookup table that contains the 64 characters used in Base64 encoding.",
    "base64_desc_text_6": "The corresponding character for each index is taken and concatenated together, resulting in a string of Base64-encoded characters.",
    "base64_desc_text_7": "If the input data is not evenly divisible by three, padding characters ('=') are added to the end to make the total length a multiple of four.",
    "base64_desc_text_8": "Decoding with Base64",
    "base64_desc_text_9": "The Base64-encoded string is divided into groups of four characters.",
    "base64_desc_text_10": "Each character is converted back to its 6-bit binary representation using the lookup table.",
    "base64_desc_text_11": "The resulting four 6-bit chunks are combined to form three bytes (24 bits).",
    "base64_desc_text_12": "If padding characters ('=') are present, they are ignored during the decoding process.",
    "base64_desc_text_13": "The final result is the decoded binary data.",
    "base64_desc_text_14": "",
    "base64_desc_text_15": "",
    "base64_desc_text_16": "",
    "base64_desc_text_17": "",
    "base64_desc_text_18": "",
    "base64_desc_text_19": "",
    "base64_desc_text_20": "",
    "webp_title": "Images to WebP",
    "webp_keywords": "convert image to webp, convert images to webp, covert jpg to webp, covert gif to webp, covert png to webp, covert jpeg to webp, covert svg to webp, covert ico to webp, covert bmp to webp",
    "webp_description": "Convert images to WebP effortlessly for faster, high-quality web performance. Ideal for developers and web designers!",
    "webp_choose_files": "Choose Files",
    "webp_choose_files_more": "or drag and drop .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp, .PNG, .JPG, .JPEG",
    "webp_download": "Download Webp",
    "webp_desc_title_1": "JPG to WebP",
    "webp_desc_text_1": "Convert your .jpg images to the modern WebP format effortlessly. Optimize image size and maintain quality with our online tool. Start converting .jpg files to WebP now!",
    "webp_desc_title_2": "GIF to WebP",
    "webp_desc_text_2": "Effortlessly convert your .gif files to WebP format for optimized web performance. Reduce file size without compromising animation quality. Convert .gif to WebP and enhance your web experience!",
    "webp_desc_title_3": "PNG to WebP",
    "webp_desc_text_3": "Convert your .png images to the efficient WebP format with ease. Preserve transparency and reduce file size for faster loading. Start converting .png files to WebP now!",
    "webp_desc_title_4": "JPEG to WebP",
    "webp_desc_text_4": "Experience faster web performance by converting your .jpeg files to WebP format. Maintain image quality while reducing file size. Convert .jpeg to WebP and boost your website's speed!",
    "webp_desc_title_5": "SVG to WebP",
    "webp_desc_text_5": "Transform your .svg files to WebP format effortlessly. Enjoy smaller file sizes and improved web compatibility. Start converting .svg files to WebP and enhance your web experience!",
    "webp_desc_title_6": "ICO to WebP",
    "webp_desc_text_6": "Optimize your website by converting .ico files to the efficient WebP format. Reduce file size without compromising icon quality. Convert .ico to WebP now and enhance your site's performance!",
    "webp_desc_title_7": "BMP to WebP",
    "webp_desc_text_7": "Convert your .bmp images to the modern WebP format with ease. Enjoy smaller file sizes and faster loading times. Start converting .bmp files to WebP and optimize your web content!",
    "info_size": "MB",
    "info_date": "Uploaded Date",
    "info_title_1": "Package Name",
    "info_title_2": "Version Code",
    "info_title_3": "Version Name",
    "info_title_4": "Supported ABIs",
    "info_title_5": "Native Libraries",
    "info_title_6": "Minimal Supported Android Version",
    "info_title_7": "Target SDK",
    "info_title_8": "Activities",
    "info_title_9": "Services",
    "info_title_10": "Broadcast Receivers",
    "info_title_11": "Content Providers",
    "info_title_12": "Requested Permissions",
    "info_title_13": "Bundle Identifier",
    "info_title_14": "Bundle Version",
    "info_title_15": "Minimum OS Version",
    "info_title_16": "Camera Usage Description",
    "info_title_17": "Microphone Usage Description",
    "info_title_18": "Supported Platforms",
    "info_title_19": "Device Family",
    "info_title_20": "Required Capabilities",
    "info_title_21": "Supported Orientations",
    "info_title_22": "Supported iPad Orientations",
    "info_title_23": "Mobile Provision Creation Date",
    "info_title_24": "TeamName",
    "info_title_25": "URL endpoints",
    "info_title_26": "IP endpoints",
    "info_tip_1": "These are the entry points for interacting with the user. Each activity represents a single screen with a user interface.",
    "info_tip_2": "Components that run in the background to perform long-running operations or to perform work for remote processes.",
    "info_tip_3": "These are components that respond to system-wide broadcast announcements. They don't display a user interface but can create a status bar notification.",
    "info_tip_4": "They manage a shared set of application data that you can store in the file system, in a SQLite database, on the web, or on any other persistent storage location that your app can access.",
    "info_tip_5": "This lists the permissions the application requests to access sensitive data or system features. Examples include access to the camera, contacts, location, etc.",
    "info_tip_6": "",
    "info_tip_7": "",
    "info_tip_8": "",
    "info_tip_9": "",
    "info_tip_10": "",
    "info_no_data": "No Data",
    "not_found": "This page could not be found.",
    "header_nav_4": "Java Decompiler",
    "java_title": "Java Decompiler Online",
    "java_description": "Optimize your Java apps using Java Decompiler Online. Analyze, decompile, and improve code to enhance performance and gain insights for a better user experience and streamlined development.",
    "java_keywords": "java decompiler, java decompiler online, apk decompiler, decompiled apk online, jar decompiler online, java class decompiler",
    "java_choose_files": "Choose Files",
    "java_choose_files_more": "or drop your apk/jar/class here",
    "java_faq": "FAQ",
    "java_faq_desc": "Find the answers for the most frequently asked questions below",
    "java_faq_title_1": "How does Java Decompiler Online work?",
    "java_faq_text_1": "Java Decompiler Online streamlines the process—simply drag and drop your Java class files for instant decompilation. Expect top-tier quality results without any hassle.",
    "java_faq_title_2": "Is the decompilation process secure?",
    "java_faq_text_2": "Rest assured, Java Decompiler Online prioritizes your privacy. Files are stored briefly for decompilation and promptly deleted, ensuring your data remains secure at all times.",
    "java_faq_title_3": "Which platforms does Java Decompiler support?",
    "java_faq_text_3": "Java Decompiler Online works on all platforms, including Mac, Linux, Ubuntu, and various Windows versions. Enjoy seamless decompilation regardless of your OS.",
    "java_faq_title_4": "Is the decompilation process user-friendly?",
    "java_faq_text_4": "Java Decompiler Online offers the simplest Java decompilation experience on the web, eliminating any learning curve. Enjoy effortless decompilation with just a few clicks.",
    "java_faq_title_5": "Does the decompilation process require any installations?",
    "java_faq_text_5": "No installations are necessary. Java Decompiler Online leverages cloud technology for quick decompilation, ensuring a hassle-free experience without any local installations.",
    "java_faq_title_6": "Can I extract Jar contents quickly using this platform?",
    "java_faq_text_6": "Absolutely. Java Decompiler Online's Jar extraction feature utilizes cloud technology for rapid extraction. Enjoy quick and efficient Jar content extraction without the need for additional installations.",
    "java_notice":"Due to the file size, the upload process may take 3 to 5 minutes. Thank you for your patience."
}