{
  "lang": "es",
  "language": "Español",
  "header_nav_1": "Analizador de APK/IPA",
  "header_nav_2": "Codificación y decodificación Base64",
  "header_nav_3": "Imagen a webp",
  "footer_nav_1": "Sobre nosotros",
  "footer_nav_2": "Seguridad",
  "footer_nav_3": "Privacidad",
  "footer_nav_4": "Términos",
  "footer_nav_5": "Contáctanos",
  "copyright": "Todos los derechos reservados",
  "title": "Analizador de APK en línea",
  "description": "Con nuestra herramienta de Analizador de APK en línea, analiza y optimiza tus APKs de Android para mejorar el rendimiento y la funcionalidad. Obtén ideas y recomendaciones detalladas para mejorar el rendimiento y la experiencia del usuario de tu aplicación.",
  "keywords": "analizador de apk, analizador de apk en línea, analizar apk en línea, herramienta de analizador de apk, analizador de red apk",
  "choose_files": "Elegir archivos",
  "choose_file_more": "o suelta tu apk/ipa aquí",
  "index_desc_title_1": "Funcionalidad",
  "index_desc_text_1": "Inspección exhaustiva del contenido del paquete APK, incluyendo el código de la aplicación, archivos de recursos, MANIFEST, bibliotecas, permisos, compatibilidad de hardware y más.",
  "index_desc_title_2": "Interfaz de usuario",
  "index_desc_text_2": "Tableros limpios e intuitivos para subir APKs y navegar por los datos técnicos y de permisos extraídos para su inspección.",
  "index_desc_title_3": "Seguridad",
  "index_desc_text_3": "Los archivos están protegidos con encriptación SSL de 256 bits y se eliminan automáticamente después de 2 horas para garantizar la confidencialidad.",
  "index_desc_title_4": "Costo",
  "index_desc_text_4": "Servicio 100% gratuito con cargas de APK y almacenamiento de datos ilimitados. Nuestra comunidad de código abierto cubre los costos de servidor y almacenamiento.",
  "index_apk_title": "APK (Paquete de Aplicación Android)",
  "index_apk_desc": "APK (Paquete de Aplicación Android) es el formato de archivo utilizado para distribuir e instalar aplicaciones en dispositivos Android. Contiene todos los archivos y recursos necesarios para que la aplicación se ejecute en una plataforma Android. Un archivo APK incluye el código de la aplicación, activos, archivo de manifiesto y certificados. Permite a los usuarios descargar e instalar aplicaciones fácilmente desde diversas fuentes. Los archivos APK se utilizan principalmente en dispositivos Android y se pueden instalar directamente o a través de tiendas de aplicaciones como Google Play.",
  "index_ipa_title": "IPA (Paquete de la App Store de iOS)",
  "index_ipa_desc": "IPA (Paquete de la App Store de iOS) es el formato de archivo utilizado para distribuir e instalar aplicaciones en dispositivos iOS. Contiene el código binario compilado, recursos y metadatos necesarios para que la aplicación se ejecute en un iPhone, iPad o iPod Touch. Un archivo IPA se crea cuando una aplicación de iOS es compilada y firmada por el desarrollador. Se puede instalar en dispositivos iOS a través de iTunes o mediante métodos de instalación inalámbrica como TestFlight de Apple. Los archivos IPA son específicos para dispositivos iOS y solo se pueden instalar en dispositivos que ejecutan iOS.",
  "base64_title": "Codificación y decodificación Base64",
  "base64_keywords": "base64 a archivo, archivo a base64, convertir archivo a base64, decodificar base64 a archivo, base64 a archivo en línea",
  "base64_description": "Codifica y decodifica datos fácilmente en formato Base64 con nuestra herramienta en línea. Convierte textos, imágenes o archivos a Base64 para una transmisión o almacenamiento de datos seguro. Decodifica cadenas Base64 a su formato original.",
  "base64_encode": "Codificar Base64",
  "base64_decode": "Decodificar Base64",
  "base64_select_text": "Selecciona el tipo",
  "base64_select_text_2": "Selecciona la extensión del archivo",
  "base64_encode_input_placeholder": "Introduce la cadena decodificada de Base64",
  "base64_encode_result_placeholder": "Encuentra el resultado aquí...",
  "base64_encode_btn": "Codificar",
  "base64_decode_input_placeholder": "Introduce la cadena codificada de Base64",
  "base64_decode_result_placeholder": "Encuentra el resultado aquí...",
  "base64_decode_btn": "Decodificar",
  "base64_choose_files": "Elegir archivos",
  "base64_choose_file_more": "o suelta tu archivo aquí",
  "base64_result": "El resultado de la codificación Base64 aparecerá aquí",
  "base64_copy": "copiar",
  "base64_clear": "limpiar",
  "base64_download": "descargar",
  "base64_desc_text_1": "Base64 es un esquema de codificación binario a texto que convierte datos binarios en un formato seguro para la transmisión a través de protocolos basados en texto, como correo electrónico o HTTP. Logra esto representando datos binarios utilizando un conjunto de 64 caracteres ASCII imprimibles.",
  "base64_desc_text_2": "Codificación con Base64",
  "base64_desc_text_3": "Los datos de entrada se dividen en grupos de tres bytes (24 bits) cada uno.",
  "base64_desc_text_4": "Cada grupo se divide en cuatro bloques de 6 bits.",
  "base64_desc_text_5": "El valor decimal de cada bloque de 6 bits se usa como un índice en una tabla de búsqueda que contiene los 64 caracteres utilizados en la codificación Base64.",
  "base64_desc_text_6": "Se toma el carácter correspondiente para cada índice y se concatenan juntos, lo que resulta en una cadena de caracteres codificados en Base64.",
  "base64_desc_text_7": "Si los datos de entrada no son divisibles por tres, se agregan caracteres de relleno ('=') al final para que la longitud total sea un múltiplo de cuatro.",
  "base64_desc_text_8": "Decodificación con Base64",
  "base64_desc_text_9": "La cadena codificada en Base64 se divide en grupos de cuatro caracteres.",
  "base64_desc_text_10": "Cada carácter se convierte nuevamente en su representación binaria de 6 bits utilizando la tabla de búsqueda.",
  "base64_desc_text_11": "Los cuatro bloques de 6 bits resultantes se combinan para formar tres bytes (24 bits).",
  "base64_desc_text_12": "Si hay caracteres de relleno ('='), se ignoran durante el proceso de decodificación.",
  "base64_desc_text_13": "El resultado final son los datos binarios decodificados.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Imágenes a WebP",
  "webp_keywords": "convertir imagen a webp, convertir imágenes a webp, convertir jpg a webp, convertir gif a webp, convertir png a webp, convertir jpeg a webp, convertir svg a webp, convertir ico a webp, convertir bmp a webp",
  "webp_description": "Convierte imágenes a WebP sin esfuerzo para un rendimiento web más rápido y de alta calidad. ¡Ideal para desarrolladores y diseñadores web!",
  "webp_choose_files": "Elegir archivos",
  "webp_choose_files_more": "o arrastra y suelta .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp aquí",
  "webp_download": "Descargar Webp",
  "webp_desc_title_1": "JPG a WebP",
  "webp_desc_text_1": "Convierte tus imágenes .jpg al moderno formato WebP sin esfuerzo. Optimiza el tamaño de la imagen y mantén la calidad con nuestra herramienta en línea. ¡Comienza a convertir archivos .jpg a WebP ahora!",
  "webp_desc_title_2": "GIF a WebP",
  "webp_desc_text_2": "Convierte tus archivos .gif al formato WebP sin esfuerzo para un rendimiento web optimizado. Reduce el tamaño del archivo sin comprometer la calidad de la animación. ¡Convierte .gif a WebP y mejora tu experiencia web!",
  "webp_desc_title_3": "PNG a WebP",
  "webp_desc_text_3": "Convierte tus imágenes .png al formato WebP de manera eficiente. Conserva la transparencia y reduce el tamaño del archivo para una carga más rápida. ¡Comienza a convertir archivos .png a WebP ahora!",
  "webp_desc_title_4": "JPEG a WebP",
  "webp_desc_text_4": "Experimenta un rendimiento web más rápido convirtiendo tus archivos .jpeg al formato WebP. Mantén la calidad de la imagen mientras reduces el tamaño del archivo. ¡Convierte .jpeg a WebP y mejora la velocidad de tu sitio web!",
  "webp_desc_title_5": "SVG a WebP",
  "webp_desc_text_5": "Transforma tus archivos .svg al formato WebP sin esfuerzo. Disfruta de tamaños de archivo más pequeños y una mejor compatibilidad web. ¡Comienza a convertir archivos .svg a WebP y mejora tu experiencia web!",
  "webp_desc_title_6": "ICO a WebP",
  "webp_desc_text_6": "Optimiza tu sitio web convirtiendo archivos .ico al eficiente formato WebP. Reduce el tamaño del archivo sin comprometer la calidad del icono. ¡Convierte .ico a WebP ahora y mejora el rendimiento de tu sitio!",
  "webp_desc_title_7": "BMP a WebP",
  "webp_desc_text_7": "Convierte tus imágenes .bmp al moderno formato WebP sin esfuerzo. Disfruta de tamaños de archivo más pequeños y tiempos de carga más rápidos. ¡Comienza a convertir archivos .bmp a WebP y optimiza tu contenido web!",
  "info_size": "MB",
  "info_date": "Fecha de subida",
  "info_title_1": "Nombre del paquete",
  "info_title_2": "Código de versión",
  "info_title_3": "Nombre de versión",
  "info_title_4": "ABI compatibles",
  "info_title_5": "Bibliotecas nativas",
  "info_title_6": "Versión mínima de Android compatible",
  "info_title_7": "SDK objetivo",
  "info_title_8": "Actividades",
  "info_title_9": "Servicios",
  "info_title_10": "Receptores de broadcast",
  "info_title_11": "Proveedores de contenido",
  "info_title_12": "Permisos solicitados",
  "info_title_13": "Identificador del paquete",
  "info_title_14": "Versión del paquete",
  "info_title_15": "Versión mínima del OS",
  "info_title_16": "Descripción del uso de la cámara",
  "info_title_17": "Descripción del uso del micrófono",
  "info_title_18": "Plataformas compatibles",
  "info_title_19": "Familia de dispositivos",
  "info_title_20": "Capacidades requeridas",
  "info_title_21": "Orientaciones compatibles",
  "info_title_22": "Orientaciones compatibles para iPad",
  "info_title_23": "Fecha de creación del provisionamiento móvil",
  "info_title_24": "Nombre del equipo",
  "info_title_25": "Puntos finales URL",
  "info_title_26": "Puntos finales IP",
  "info_tip_1": "Estos son los puntos de entrada para interactuar con el usuario. Cada actividad representa una sola pantalla con una interfaz de usuario.",
  "info_tip_2": "Son componentes que se ejecutan en segundo plano para realizar operaciones de larga duración o para realizar trabajos para procesos remotos.",
  "info_tip_3": "Estos son componentes que responden a anuncios de difusión a nivel del sistema. No muestran una interfaz de usuario pero pueden crear una notificación en la barra de estado.",
  "info_tip_4": "Gestionan un conjunto compartido de datos de la aplicación que puedes almacenar en el sistema de archivos, en una base de datos SQLite, en la web o en cualquier otro lugar de almacenamiento persistente al que pueda acceder tu aplicación.",
  "info_tip_5": "Esta lista incluye los permisos que la aplicación solicita para acceder a datos sensibles o funciones del sistema. Ejemplos incluyen acceso a la cámara, contactos, ubicación, etc.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Sin datos",
  "not_found": "No se pudo encontrar esta página.",
  "header_nav_4": "Descompilador de Java",
  "java_title": "Descompilador de Java en línea",
  "java_description": "Optimiza tus aplicaciones Java utilizando el Descompilador de Java en línea. Analiza, descompila y mejora el código para aumentar el rendimiento y obtener ideas para una mejor experiencia de usuario y un desarrollo optimizado.",
  "java_keywords": "descompilador de java, descompilador de java en línea, descompilador de apk, apk descompilado en línea, descompilador de jar en línea, descompilador de clase java",
  "java_choose_files": "Elegir archivos",
  "java_choose_files_more": "o suelta tu apk/jar/class aquí",
  "java_faq": "Preguntas frecuentes",
  "java_faq_desc": "Encuentra las respuestas a las preguntas más frecuentes a continuación",
  "java_faq_title_1": "¿Cómo funciona el Descompilador de Java en línea?",
  "java_faq_text_1": "El Descompilador de Java en línea simplifica el proceso: simplemente arrastra y suelta tus archivos de clase Java para una descompilación instantánea. Espera resultados de alta calidad sin complicaciones.",
  "java_faq_title_2": "¿Es seguro el proceso de descompilación?",
  "java_faq_text_2": "Ten la seguridad de que el Descompilador de Java en línea prioriza tu privacidad. Los archivos se almacenan brevemente para la descompilación y se eliminan rápidamente, asegurando que tus datos se mantengan seguros en todo momento.",
  "java_faq_title_3": "¿Qué plataformas soporta el Descompilador de Java?",
  "java_faq_text_3": "El Descompilador de Java en línea funciona en todas las plataformas, incluyendo Mac, Linux, Ubuntu y varias versiones de Windows. Disfruta de una descompilación sin problemas sin importar tu sistema operativo.",
  "java_faq_title_4": "¿Es fácil de usar el proceso de descompilación?",
  "java_faq_text_4": "El Descompilador de Java en línea ofrece la experiencia de descompilación de Java más sencilla en la web, eliminando cualquier curva de aprendizaje. Disfruta de una descompilación sin esfuerzo con solo unos pocos clics.",
  "java_faq_title_5": "¿Requiere instalaciones el proceso de descompilación?",
  "java_faq_text_5": "No se requieren instalaciones. El Descompilador de Java en línea aprovecha la tecnología en la nube para una descompilación rápida, asegurando una experiencia sin complicaciones sin instalaciones locales.",
  "java_faq_title_6": "¿Puedo extraer rápidamente el contenido de Jar usando esta plataforma?",
  "java_faq_text_6": "Absolutamente. La función de extracción de Jar del Descompilador de Java en línea utiliza la tecnología en la nube para una extracción rápida. Disfruta de una extracción de contenido de Jar rápida y eficiente sin necesidad de instalaciones adicionales.",
  "java_notice": "Debido al tamaño del archivo, el proceso de carga puede tardar de 3 a 5 minutos. Gracias por tu paciencia."
}