{
  "lang": "fr",
  "language": "Français",
  "header_nav_1": "Analyseur APK/IPA",
  "header_nav_2": "Encodage et décodage Base64",
  "header_nav_3": "Image en webp",
  "footer_nav_1": "À propos de nous",
  "footer_nav_2": "Sécurité",
  "footer_nav_3": "Confidentialité",
  "footer_nav_4": "Conditions",
  "footer_nav_5": "Contactez-nous",
  "copyright": "Tous droits réservés",
  "title": "Analyseur d'APK en ligne",
  "description": "Avec notre outil d'analyseur d'APK en ligne, analysez et optimisez vos APK Android pour améliorer les performances et la fonctionnalité. Obtenez des insights et des recommandations détaillés pour améliorer les performances et l'expérience utilisateur de votre application.",
  "keywords": "analyseur apk, analyseur apk en ligne, analyser apk en ligne, outil d'analyseur apk, analyseur réseau apk",
  "choose_files": "Choisir des fichiers",
  "choose_file_more": "ou déposez votre apk/ipa ici",
  "index_desc_title_1": "Fonctionnalité",
  "index_desc_text_1": "Inspection complète du contenu du paquet APK, y compris le code de l'application, les fichiers de ressources, le MANIFEST, les bibliothèques, les autorisations, la compatibilité matérielle et plus encore.",
  "index_desc_title_2": "Interface utilisateur",
  "index_desc_text_2": "Tableaux de bord propres et intuitifs pour télécharger des APK et naviguer dans les données techniques et d'autorisation extraites pour l'inspection.",
  "index_desc_title_3": "Sécurité",
  "index_desc_text_3": "Les fichiers sont protégés par un cryptage SSL 256 bits et sont automatiquement supprimés après 2 heures pour garantir la confidentialité.",
  "index_desc_title_4": "Coût",
  "index_desc_text_4": "Service 100% gratuit avec téléchargements d'APK illimités et stockage de données. Notre communauté open source couvre les coûts de serveur et de stockage.",
  "index_apk_title": "APK (Android Application Package)",
  "index_apk_desc": "APK (Android Application Package) est le format de fichier utilisé pour distribuer et installer des applications sur des appareils Android. Il contient tous les fichiers et ressources nécessaires pour que l'application fonctionne sur une plateforme Android. Un fichier APK comprend le code de l'application, les ressources, le fichier manifeste et les certificats. Il permet aux utilisateurs de télécharger et d'installer des applications facilement depuis diverses sources. Les fichiers APK sont principalement utilisés sur les appareils Android et peuvent être installés directement ou via des magasins d'applications comme Google Play.",
  "index_ipa_title": "IPA (Paquet de l'App Store iOS)",
  "index_ipa_desc": "IPA (Paquet de l'App Store iOS) est le format de fichier utilisé pour distribuer et installer des applications sur des appareils iOS. Il contient le code binaire compilé, les ressources et les métadonnées nécessaires pour que l'application fonctionne sur un iPhone, iPad ou iPod Touch. Un fichier IPA est créé lorsqu'une application iOS est compilée et signée par le développeur. Il peut être installé sur des appareils iOS via iTunes ou par des méthodes d'installation en direct comme TestFlight d'Apple. Les fichiers IPA sont spécifiques aux appareils iOS et ne peuvent être installés que sur des appareils exécutant iOS.",
  "base64_title": "Encodage et décodage Base64",
  "base64_keywords": "base64 en fichier, fichier en base64, convertir fichier en base64, décoder base64 en fichier, base64 en fichier en ligne",
  "base64_description": "Encodez et décodez facilement des données au format Base64 avec notre outil en ligne. Convertissez des textes, images ou fichiers en Base64 pour une transmission ou un stockage sécurisé des données. Décodez les chaînes Base64 dans leur format original.",
  "base64_encode": "Encoder en Base64",
  "base64_decode": "Décoder en Base64",
  "base64_select_text": "Sélectionnez le type",
  "base64_select_text_2": "Sélectionnez l'extension du fichier",
  "base64_encode_input_placeholder": "Entrez la chaîne décodée en Base64",
  "base64_encode_result_placeholder": "Trouvez le résultat ici...",
  "base64_encode_btn": "Encoder",
  "base64_decode_input_placeholder": "Entrez la chaîne encodée en Base64",
  "base64_decode_result_placeholder": "Trouvez le résultat ici...",
  "base64_decode_btn": "Décoder",
  "base64_choose_files": "Choisir des fichiers",
  "base64_choose_file_more": "ou déposez votre fichier ici",
  "base64_result": "Le résultat de l'encodage Base64 apparaîtra ici",
  "base64_copy": "copier",
  "base64_clear": "effacer",
  "base64_download": "télécharger",
  "base64_desc_text_1": "Base64 est un schéma d'encodage binaire-texte qui convertit des données binaires en un format sûr pour la transmission via des protocoles basés sur du texte, tels que l'email ou HTTP. Il atteint cela en représentant des données binaires à l'aide d'un ensemble de 64 caractères ASCII imprimables.",
  "base64_desc_text_2": "Encodage avec Base64",
  "base64_desc_text_3": "Les données d'entrée sont divisées en groupes de trois octets (24 bits) chacun.",
  "base64_desc_text_4": "Chaque groupe est ensuite divisé en quatre morceaux de 6 bits.",
  "base64_desc_text_5": "La valeur décimale de chaque morceau de 6 bits est utilisée comme indice dans une table de correspondance contenant les 64 caractères utilisés dans l'encodage Base64.",
  "base64_desc_text_6": "Le caractère correspondant à chaque indice est pris et concaténé ensemble, ce qui donne une chaîne de caractères encodés en Base64.",
  "base64_desc_text_7": "Si les données d'entrée ne sont pas divisibles par trois, des caractères de remplissage ('=') sont ajoutés à la fin pour que la longueur totale soit un multiple de quatre.",
  "base64_desc_text_8": "Décodage avec Base64",
  "base64_desc_text_9": "La chaîne encodée en Base64 est divisée en groupes de quatre caractères.",
  "base64_desc_text_10": "Chaque caractère est reconverti en sa représentation binaire de 6 bits en utilisant la table de correspondance.",
  "base64_desc_text_11": "Les quatre morceaux de 6 bits résultants sont combinés pour former trois octets (24 bits).",
  "base64_desc_text_12": "Si des caractères de remplissage ('=') sont présents, ils sont ignorés pendant le processus de décodage.",
  "base64_desc_text_13": "Le résultat final est les données binaires décodées.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Images en WebP",
  "webp_keywords": "convertir image en webp, convertir images en webp, convertir jpg en webp, convertir gif en webp, convertir png en webp, convertir jpeg en webp, convertir svg en webp, convertir ico en webp, convertir bmp en webp",
  "webp_description": "Convertissez des images en WebP sans effort pour des performances web plus rapides et de haute qualité. Idéal pour les développeurs et les concepteurs web !",
  "webp_choose_files": "Choisir des fichiers",
  "webp_choose_files_more": "ou faites glisser et déposez .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp ici",
  "webp_download": "Télécharger Webp",
  "webp_desc_title_1": "JPG en WebP",
  "webp_desc_text_1": "Convertissez vos images .jpg au format moderne WebP sans effort. Optimisez la taille de l'image et conservez la qualité avec notre outil en ligne. Commencez à convertir des fichiers .jpg en WebP dès maintenant !",
  "webp_desc_title_2": "GIF en WebP",
  "webp_desc_text_2": "Convertissez vos fichiers .gif au format WebP sans effort pour des performances web optimisées. Réduisez la taille du fichier sans compromettre la qualité de l'animation. Convertissez .gif en WebP et améliorez votre expérience web !",
  "webp_desc_title_3": "PNG en WebP",
  "webp_desc_text_3": "Convertissez vos images .png au format WebP de manière efficace. Préservez la transparence et réduisez la taille du fichier pour des chargements plus rapides. Commencez à convertir des fichiers .png en WebP dès maintenant !",
  "webp_desc_title_4": "JPEG en WebP",
  "webp_desc_text_4": "Expérimentez des performances web plus rapides en convertissant vos fichiers .jpeg au format WebP. Conservez la qualité de l'image tout en réduisant la taille du fichier. Convertissez .jpeg en WebP et augmentez la vitesse de votre site web !",
  "webp_desc_title_5": "SVG en WebP",
  "webp_desc_text_5": "Transformez vos fichiers .svg au format WebP sans effort. Profitez de tailles de fichiers plus petites et d'une meilleure compatibilité web. Commencez à convertir des fichiers .svg en WebP et améliorez votre expérience web !",
  "webp_desc_title_6": "ICO en WebP",
  "webp_desc_text_6": "Optimisez votre site web en convertissant des fichiers .ico au format WebP efficace. Réduisez la taille du fichier sans compromettre la qualité des icônes. Convertissez .ico en WebP maintenant et améliorez les performances de votre site !",
  "webp_desc_title_7": "BMP en WebP",
  "webp_desc_text_7": "Convertissez vos images .bmp au format moderne WebP sans effort. Profitez de tailles de fichiers plus petites et de temps de chargement plus rapides. Commencez à convertir des fichiers .bmp en WebP et optimisez votre contenu web !",
  "info_size": "MB",
  "info_date": "Date de téléchargement",
  "info_title_1": "Nom du paquet",
  "info_title_2": "Code de version",
  "info_title_3": "Nom de version",
  "info_title_4": "ABI pris en charge",
  "info_title_5": "Bibliothèques natives",
  "info_title_6": "Version minimale d'Android prise en charge",
  "info_title_7": "SDK cible",
  "info_title_8": "Activités",
  "info_title_9": "Services",
  "info_title_10": "Récepteurs de diffusion",
  "info_title_11": "Fournisseurs de contenu",
  "info_title_12": "Autorisations demandées",
  "info_title_13": "Identifiant du bundle",
  "info_title_14": "Version du bundle",
  "info_title_15": "Version minimale de l'OS",
  "info_title_16": "Description de l'utilisation de la caméra",
  "info_title_17": "Description de l'utilisation du microphone",
  "info_title_18": "Plateformes prises en charge",
  "info_title_19": "Famille de dispositifs",
  "info_title_20": "Capacités requises",
  "info_title_21": "Orientations prises en charge",
  "info_title_22": "Orientations prises en charge pour iPad",
  "info_title_23": "Date de création du provisionnement mobile",
  "info_title_24": "Nom de l'équipe",
  "info_title_25": "Points de terminaison URL",
  "info_title_26": "Points de terminaison IP",
  "info_tip_1": "Ce sont les points d'entrée pour interagir avec l'utilisateur. Chaque activité représente un seul écran avec une interface utilisateur.",
  "info_tip_2": "Ce sont des composants qui s'exécutent en arrière-plan pour effectuer des opérations de longue durée ou pour effectuer un travail pour des processus distants.",
  "info_tip_3": "Ce sont des composants qui répondent aux annonces de diffusion à l'échelle du système. Ils n'affichent pas d'interface utilisateur mais peuvent créer une notification dans la barre d'état.",
  "info_tip_4": "Ils gèrent un ensemble partagé de données d'application que vous pouvez stocker dans le système de fichiers, dans une base de données SQLite, sur le web ou sur tout autre emplacement de stockage persistant auquel votre application peut accéder.",
  "info_tip_5": "Cela liste les autorisations que l'application demande pour accéder aux données sensibles ou aux fonctionnalités du système. Les exemples incluent l'accès à la caméra, aux contacts, à la localisation, etc.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Pas de données",
  "not_found": "Cette page n'a pas pu être trouvée.",
  "header_nav_4": "Décompilateur Java",
  "java_title": "Décompilateur Java en ligne",
  "java_description": "Optimisez vos applications Java en utilisant le Décompilateur Java en ligne. Analysez, décompilez et améliorez le code pour augmenter les performances et obtenir des idées pour une meilleure expérience utilisateur et un développement rationalisé.",
  "java_keywords": "décompilateur java, décompilateur java en ligne, décompilateur apk, apk décompilé en ligne, décompilateur jar en ligne, décompilateur de classe java",
  "java_choose_files": "Choisir des fichiers",
  "java_choose_files_more": "ou déposez votre apk/jar/class ici",
  "java_faq": "FAQ",
  "java_faq_desc": "Trouvez ci-dessous les réponses aux questions les plus fréquemment posées",
  "java_faq_title_1": "Comment fonctionne le Décompilateur Java en ligne ?",
  "java_faq_text_1": "Le Décompilateur Java en ligne simplifie le processus : il suffit de glisser-déposer vos fichiers de classe Java pour une décompilation instantanée. Attendez-vous à des résultats de haute qualité sans tracas.",
  "java_faq_title_2": "Le processus de décompilation est-il sécurisé ?",
  "java_faq_text_2": "Soyez assuré que le Décompilateur Java en ligne priorise votre confidentialité. Les fichiers sont stockés brièvement pour la décompilation et rapidement supprimés, garantissant que vos données restent sécurisées à tout moment.",
  "java_faq_title_3": "Quelles plateformes sont prises en charge par le Décompilateur Java ?",
  "java_faq_text_3": "Le Décompilateur Java en ligne fonctionne sur toutes les plateformes, y compris Mac, Linux, Ubuntu et diverses versions de Windows. Profitez d'une décompilation fluide quel que soit votre système d'exploitation.",
  "java_faq_title_4": "Le processus de décompilation est-il convivial ?",
  "java_faq_text_4": "Le Décompilateur Java en ligne offre l'expérience de décompilation Java la plus simple sur le web, éliminant toute courbe d'apprentissage. Profitez d'une décompilation sans effort en quelques clics seulement.",
  "java_faq_title_5": "Le processus de décompilation nécessite-t-il des installations ?",
  "java_faq_text_5": "Aucune installation n'est nécessaire. Le Décompilateur Java en ligne utilise la technologie cloud pour une décompilation rapide, assurant une expérience sans tracas sans installations locales.",
  "java_faq_title_6": "Puis-je extraire rapidement le contenu de Jar en utilisant cette plateforme ?",
  "java_faq_text_6": "Absolument. La fonction d'extraction Jar du Décompilateur Java en ligne utilise la technologie cloud pour une extraction rapide. Profitez d'une extraction rapide et efficace du contenu Jar sans installations supplémentaires.",
  "java_notice": "En raison de la taille du fichier, le processus de téléchargement peut prendre de 3 à 5 minutes. Merci de votre patience."
}