{
  "lang": "id",
  "language": "Bahasa Indonesia",
  "header_nav_1": "APK/IPA Analyzer",
  "header_nav_2": "Base64 Encoding dan Decoding",
  "header_nav_3": "Gambar ke webp",
  "footer_nav_1": "Tentang Kami",
  "footer_nav_2": "Keamanan",
  "footer_nav_3": "Privasi",
  "footer_nav_4": "Syarat",
  "footer_nav_5": "Hubungi Kami",
  "copyright": "Hak Cipta Dilindungi",
  "title": "Apk Analyzer Online",
  "description": "Dengan alat Apk Analyzer Online kami, analisis dan optimalkan APK Android Anda untuk meningkatkan kinerja dan fungsionalitas. Dapatkan wawasan dan rekomendasi terperinci untuk meningkatkan kinerja dan pengalaman pengguna aplikasi Anda.",
  "keywords": "apk analyzer, apk analyzer online, analisis apk online, alat apk analyzer, network analyzer apk",
  "choose_files": "Pilih File",
  "choose_file_more": "atau jatuhkan apk/ipa Anda di sini",
  "index_desc_title_1": "Fungsionalitas",
  "index_desc_text_1": "Inspeksi komprehensif isi paket APK termasuk kode aplikasi, file sumber daya, MANIFEST, perpustakaan, izin, kompatibilitas perangkat keras, dan banyak lagi.",
  "index_desc_title_2": "Antarmuka Pengguna",
  "index_desc_text_2": "Dasbor bersih dan intuitif untuk mengunggah APK dan menavigasi data teknis dan izin yang diekstraksi untuk inspeksi.",
  "index_desc_title_3": "Keamanan",
  "index_desc_text_3": "File dilindungi dengan enkripsi SSL 256-bit dan secara otomatis dihapus setelah 2 jam untuk memastikan kerahasiaan.",
  "index_desc_title_4": "Biaya",
  "index_desc_text_4": "Layanan 100% gratis dengan unggahan APK dan penyimpanan data tanpa batas. Komunitas open source kami menanggung biaya server dan penyimpanan.",
  "index_apk_title": "APK (Paket Aplikasi Android)",
  "index_apk_desc": "APK (Paket Aplikasi Android) adalah format file yang digunakan untuk mendistribusikan dan menginstal aplikasi di perangkat Android. Ini berisi semua file dan sumber daya yang diperlukan untuk menjalankan aplikasi pada platform Android. File APK mencakup kode aplikasi, aset, file manifest, dan sertifikat. Ini memungkinkan pengguna untuk mengunduh dan menginstal aplikasi dengan mudah dari berbagai sumber. File APK terutama digunakan pada perangkat Android dan dapat diinstal langsung atau melalui toko aplikasi seperti Google Play.",
  "index_ipa_title": "IPA (Paket App Store iOS)",
  "index_ipa_desc": "IPA (Paket App Store iOS) adalah format file yang digunakan untuk mendistribusikan dan menginstal aplikasi di perangkat iOS. Ini berisi kode biner yang dikompilasi, sumber daya, dan metadata yang diperlukan untuk menjalankan aplikasi pada iPhone, iPad, atau iPod Touch. File IPA dibuat ketika aplikasi iOS dikompilasi dan ditandatangani oleh pengembang. Ini dapat diinstal di perangkat iOS melalui iTunes atau melalui metode instalasi over-the-air seperti TestFlight Apple. File IPA khusus untuk perangkat iOS dan hanya dapat diinstal pada perangkat yang menjalankan iOS.",
  "base64_title": "Base64 Encoding dan Decoding",
  "base64_keywords": "base64 ke file, file ke base64, konversi file ke base64, decode base64 ke file, base64 ke file online",
  "base64_description": "Dengan mudah encode dan decode data ke dan dari format Base64 dengan alat online kami. Konversi teks, gambar, atau file ke Base64 untuk transmisi atau penyimpanan data yang aman. Decode string Base64 kembali ke format aslinya.",
  "base64_encode": "Encode Base64",
  "base64_decode": "Decode Base64",
  "base64_select_text": "Pilih tipe",
  "base64_select_text_2": "Pilih ekstensi file",
  "base64_encode_input_placeholder": "Masukkan string Base64 yang didekode",
  "base64_encode_result_placeholder": "Temukan hasil di sini...",
  "base64_encode_btn": "Encode",
  "base64_decode_input_placeholder": "Masukkan string Base64 yang diencode",
  "base64_decode_result_placeholder": "Temukan hasil di sini...",
  "base64_decode_btn": "Decode",
  "base64_choose_files": "Pilih File",
  "base64_choose_file_more": "atau jatuhkan file Anda di sini",
  "base64_result": "Hasil encode Base64 akan muncul di sini",
  "base64_copy": "salin",
  "base64_clear": "hapus",
  "base64_download": "unduh",
  "base64_desc_text_1": "Base64 adalah skema encoding biner-ke-teks yang mengubah data biner menjadi format yang aman untuk transmisi melalui protokol berbasis teks, seperti email atau HTTP. Ini mencapainya dengan mewakili data biner menggunakan satu set 64 karakter ASCII yang dapat dicetak.",
  "base64_desc_text_2": "Encoding dengan Base64",
  "base64_desc_text_3": "Data input dibagi menjadi grup tiga byte (24 bit) masing-masing.",
  "base64_desc_text_4": "Setiap grup kemudian dibagi menjadi empat potongan 6-bit.",
  "base64_desc_text_5": "Nilai desimal dari setiap potongan 6-bit digunakan sebagai indeks dalam tabel pencarian yang berisi 64 karakter yang digunakan dalam encoding Base64.",
  "base64_desc_text_6": "Karakter yang sesuai untuk setiap indeks diambil dan digabungkan bersama, menghasilkan string karakter yang diencode dengan Base64.",
  "base64_desc_text_7": "Jika data input tidak habis dibagi tiga, karakter padding ('=') ditambahkan ke akhir untuk membuat panjang total menjadi kelipatan empat.",
  "base64_desc_text_8": "Decoding dengan Base64",
  "base64_desc_text_9": "String yang diencode dengan Base64 dibagi menjadi grup empat karakter.",
  "base64_desc_text_10": "Setiap karakter dikonversi kembali ke representasi biner 6-bit menggunakan tabel pencarian.",
  "base64_desc_text_11": "Empat potongan 6-bit yang dihasilkan digabungkan untuk membentuk tiga byte (24 bit).",
  "base64_desc_text_12": "Jika ada karakter padding ('='), mereka diabaikan selama proses decoding.",
  "base64_desc_text_13": "Hasil akhirnya adalah data biner yang didekode.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Gambar ke WebP",
  "webp_keywords": "konversi gambar ke webp, konversi gambar ke webp, konversi jpg ke webp, konversi gif ke webp, konversi png ke webp, konversi jpeg ke webp, konversi svg ke webp, konversi ico ke webp, konversi bmp ke webp",
  "webp_description": "Konversi gambar ke WebP dengan mudah untuk kinerja web yang lebih cepat dan berkualitas tinggi. Ideal untuk pengembang dan desainer web!",
  "webp_choose_files": "Pilih File",
  "webp_choose_files_more": "atau seret dan jatuhkan .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp",
  "webp_download": "Unduh Webp",
  "webp_desc_title_1": "JPG ke WebP",
  "webp_desc_text_1": "Konversi gambar .jpg Anda ke format WebP modern dengan mudah. Optimalkan ukuran gambar dan pertahankan kualitas dengan alat online kami. Mulailah mengkonversi file .jpg ke WebP sekarang!",
  "webp_desc_title_2": "GIF ke WebP",
  "webp_desc_text_2": "Konversi file .gif Anda ke format WebP dengan mudah untuk kinerja web yang optimal. Kurangi ukuran file tanpa mengorbankan kualitas animasi. Konversi .gif ke WebP dan tingkatkan pengalaman web Anda!",
  "webp_desc_title_3": "PNG ke WebP",
  "webp_desc_text_3": "Konversi gambar .png Anda ke format WebP yang efisien dengan mudah. Pertahankan transparansi dan kurangi ukuran file untuk pemuatan lebih cepat. Mulailah mengkonversi file .png ke WebP sekarang!",
  "webp_desc_title_4": "JPEG ke WebP",
  "webp_desc_text_4": "Rasakan kinerja web yang lebih cepat dengan mengkonversi file .jpeg Anda ke format WebP. Pertahankan kualitas gambar sambil mengurangi ukuran file. Konversi .jpeg ke WebP dan tingkatkan kecepatan situs web Anda!",
  "webp_desc_title_5": "SVG ke WebP",
  "webp_desc_text_5": "Ubah file .svg Anda ke format WebP dengan mudah. Nikmati ukuran file yang lebih kecil dan kompatibilitas web yang lebih baik. Mulailah mengkonversi file .svg ke WebP dan tingkatkan pengalaman web Anda!",
  "webp_desc_title_6": "ICO ke WebP",
  "webp_desc_text_6": "Optimalkan situs web Anda dengan mengkonversi file .ico ke format WebP yang efisien. Kurangi ukuran file tanpa mengorbankan kualitas ikon. Konversi .ico ke WebP sekarang dan tingkatkan kinerja situs Anda!",
  "webp_desc_title_7": "BMP ke WebP",
  "webp_desc_text_7": "Konversi gambar .bmp Anda ke format WebP modern dengan mudah. Nikmati ukuran file yang lebih kecil dan waktu pemuatan yang lebih cepat. Mulailah mengkonversi file .bmp ke WebP dan optimalkan konten web Anda!",
  "info_size": "MB",
  "info_date": "Tanggal Diupload",
  "info_title_1": "Nama Paket",
  "info_title_2": "Kode Versi",
  "info_title_3": "Nama Versi",
  "info_title_4": "ABI yang Didukung",
  "info_title_5": "Perpustakaan Asli",
  "info_title_6": "Versi Android Minimal yang Didukung",
  "info_title_7": "Target SDK",
  "info_title_8": "Aktivitas",
  "info_title_9": "Layanan",
  "info_title_10": "Penerima Siaran",
  "info_title_11": "Penyedia Konten",
  "info_title_12": "Izin yang Diminta",
  "info_title_13": "Identifikasi Bundel",
  "info_title_14": "Versi Bundel",
  "info_title_15": "Versi OS Minimum",
  "info_title_16": "Deskripsi Penggunaan Kamera",
  "info_title_17": "Deskripsi Penggunaan Mikrofon",
  "info_title_18": "Platform yang Didukung",
  "info_title_19": "Keluarga Perangkat",
  "info_title_20": "Kemampuan yang Diperlukan",
  "info_title_21": "Orientasi yang Didukung",
  "info_title_22": "Orientasi iPad yang Didukung",
  "info_title_23": "Tanggal Pembuatan Provisioning Seluler",
  "info_title_24": "Nama Tim",
  "info_title_25": "Titik Akhir URL",
  "info_title_26": "Titik Akhir IP",
  "info_tip_1": "Ini adalah titik masuk untuk berinteraksi dengan pengguna. Setiap aktivitas mewakili satu layar dengan antarmuka pengguna.",
  "info_tip_2": "Ini adalah komponen yang berjalan di latar belakang untuk melakukan operasi yang memakan waktu lama atau untuk melakukan pekerjaan untuk proses jarak jauh.",
  "info_tip_3": "Ini adalah komponen yang merespons pengumuman siaran di seluruh sistem. Mereka tidak menampilkan antarmuka pengguna tetapi dapat membuat notifikasi bilah status.",
  "info_tip_4": "Ini mengelola kumpulan data aplikasi bersama yang dapat Anda simpan di sistem file, di database SQLite, di web, atau di lokasi penyimpanan persisten lainnya yang dapat diakses aplikasi Anda.",
  "info_tip_5": "Ini mencantumkan izin yang diminta aplikasi untuk mengakses data sensitif atau fitur sistem. Contohnya termasuk akses ke kamera, kontak, lokasi, dll.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Tidak ada data",
  "not_found": "Halaman ini tidak dapat ditemukan.",
  "header_nav_4": "Java Decompiler",
  "java_title": "Java Decompiler Online",
  "java_description": "Optimalkan aplikasi Java Anda menggunakan Java Decompiler Online. Analisis, dekompilasi, dan tingkatkan kode untuk meningkatkan kinerja dan dapatkan wawasan untuk pengalaman pengguna yang lebih baik dan pengembangan yang efisien.",
  "java_keywords": "java decompiler, java decompiler online, apk decompiler, decompiled apk online, jar decompiler online, java class decompiler",
  "java_choose_files": "Pilih File",
  "java_choose_files_more": "atau jatuhkan apk/jar/class Anda di sini",
  "java_faq": "FAQ",
  "java_faq_desc": "Temukan jawaban untuk pertanyaan yang paling sering diajukan di bawah ini",
  "java_faq_title_1": "Bagaimana cara kerja Java Decompiler Online?",
  "java_faq_text_1": "Java Decompiler Online menyederhanakan prosesnya - cukup seret dan jatuhkan file kelas Java Anda untuk dekompilasi instan. Harapkan hasil berkualitas tinggi tanpa kerumitan.",
  "java_faq_title_2": "Apakah proses dekompilasi aman?",
  "java_faq_text_2": "Yakinlah, Java Decompiler Online memprioritaskan privasi Anda. File disimpan sementara untuk dekompilasi dan segera dihapus, memastikan data Anda tetap aman setiap saat.",
  "java_faq_title_3": "Platform apa saja yang didukung oleh Java Decompiler?",
  "java_faq_text_3": "Java Decompiler Online berfungsi di semua platform, termasuk Mac, Linux, Ubuntu, dan berbagai versi Windows. Nikmati dekompilasi yang mulus terlepas dari OS Anda.",
  "java_faq_title_4": "Apakah proses dekompilasi ramah pengguna?",
  "java_faq_text_4": "Java Decompiler Online menawarkan pengalaman dekompilasi Java paling sederhana di web, menghilangkan kurva belajar. Nikmati dekompilasi tanpa usaha dengan hanya beberapa klik.",
  "java_faq_title_5": "Apakah proses dekompilasi memerlukan instalasi?",
  "java_faq_text_5": "Tidak diperlukan instalasi. Java Decompiler Online memanfaatkan teknologi cloud untuk dekompilasi cepat, memastikan pengalaman tanpa kerumitan tanpa instalasi lokal.",
  "java_faq_title_6": "Dapatkah saya mengekstrak konten Jar dengan cepat menggunakan platform ini?",
  "java_faq_text_6": "Tentu saja. Fitur ekstraksi Jar dari Java Decompiler Online menggunakan teknologi cloud untuk ekstraksi cepat. Nikmati ekstraksi konten Jar yang cepat dan efisien tanpa perlu instalasi tambahan.",
  "java_notice": "Karena ukuran file, proses unggah dapat memakan waktu 3 hingga 5 menit. Terima kasih atas kesabaran Anda."
}