{
  "lang": "it",
  "language": "Italiano",
  "header_nav_1": "Analizzatore APK/IPA",
  "header_nav_2": "Codifica e decodifica Base64",
  "header_nav_3": "Immagine in webp",
  "footer_nav_1": "Chi siamo",
  "footer_nav_2": "Sicurezza",
  "footer_nav_3": "Privacy",
  "footer_nav_4": "Termini",
  "footer_nav_5": "Contattaci",
  "copyright": "Tutti i diritti riservati",
  "title": "Analizzatore APK Online",
  "description": "Con il nostro strumento di analisi APK online, analizza e ottimizza i tuoi APK Android per migliorare le prestazioni e la funzionalità. Ottieni approfondimenti e raccomandazioni dettagliate per migliorare le prestazioni e l'esperienza utente della tua app.",
  "keywords": "analizzatore apk, analizzatore apk online, analizza apk online, strumento di analisi apk, analizzatore di rete apk",
  "choose_files": "Scegli file",
  "choose_file_more": "oppure trascina e rilascia il tuo apk/ipa qui",
  "index_desc_title_1": "Funzionalità",
  "index_desc_text_1": "Ispezione completa del contenuto del pacchetto APK, inclusi il codice dell'app, i file di risorse, il MANIFEST, le librerie, le autorizzazioni, la compatibilità hardware e altro.",
  "index_desc_title_2": "Interfaccia utente",
  "index_desc_text_2": "Dashboard puliti e intuitivi per caricare APK e navigare nei dati tecnici e delle autorizzazioni estratti per l'ispezione.",
  "index_desc_title_3": "Sicurezza",
  "index_desc_text_3": "I file sono protetti con crittografia SSL a 256 bit e vengono automaticamente eliminati dopo 2 ore per garantire la riservatezza.",
  "index_desc_title_4": "Costo",
  "index_desc_text_4": "Servizio 100% gratuito con upload di APK e archiviazione dati illimitati. La nostra comunità open source copre i costi di server e archiviazione.",
  "index_apk_title": "APK (Android Application Package)",
  "index_apk_desc": "APK (Android Application Package) è il formato di file utilizzato per distribuire e installare applicazioni su dispositivi Android. Contiene tutti i file e le risorse necessari per eseguire l'app su una piattaforma Android. Un file APK include il codice dell'app, le risorse, il file manifesto e i certificati. Consente agli utenti di scaricare e installare app facilmente da varie fonti. I file APK sono utilizzati principalmente su dispositivi Android e possono essere installati direttamente o tramite app store come Google Play.",
  "index_ipa_title": "IPA (Pacchetto App Store iOS)",
  "index_ipa_desc": "IPA (Pacchetto App Store iOS) è il formato di file utilizzato per distribuire e installare applicazioni su dispositivi iOS. Contiene il codice binario compilato, le risorse e i metadati necessari per eseguire l'app su un iPhone, iPad o iPod Touch. Un file IPA viene creato quando un'app iOS viene compilata e firmata dallo sviluppatore. Può essere installato su dispositivi iOS tramite iTunes o tramite metodi di installazione over-the-air come TestFlight di Apple. I file IPA sono specifici per i dispositivi iOS e possono essere installati solo su dispositivi che eseguono iOS.",
  "base64_title": "Codifica e decodifica Base64",
  "base64_keywords": "base64 a file, file a base64, converti file in base64, decodifica base64 in file, base64 a file online",
  "base64_description": "Codifica e decodifica facilmente i dati nel formato Base64 con il nostro strumento online. Converti testi, immagini o file in Base64 per una trasmissione o archiviazione sicura dei dati. Decodifica stringhe Base64 nel loro formato originale.",
  "base64_encode": "Codifica Base64",
  "base64_decode": "Decodifica Base64",
  "base64_select_text": "Seleziona il tipo",
  "base64_select_text_2": "Seleziona l'estensione del file",
  "base64_encode_input_placeholder": "Inserisci la stringa decodificata Base64",
  "base64_encode_result_placeholder": "Trova il risultato qui...",
  "base64_encode_btn": "Codifica",
  "base64_decode_input_placeholder": "Inserisci la stringa codificata Base64",
  "base64_decode_result_placeholder": "Trova il risultato qui...",
  "base64_decode_btn": "Decodifica",
  "base64_choose_files": "Scegli file",
  "base64_choose_file_more": "oppure trascina e rilascia il tuo file qui",
  "base64_result": "Il risultato della codifica Base64 apparirà qui",
  "base64_copy": "copia",
  "base64_clear": "pulisci",
  "base64_download": "scarica",
  "base64_desc_text_1": "Base64 è uno schema di codifica binario a testo che converte i dati binari in un formato sicuro per la trasmissione tramite protocolli basati su testo, come email o HTTP. Lo fa rappresentando i dati binari utilizzando un insieme di 64 caratteri ASCII stampabili.",
  "base64_desc_text_2": "Codifica con Base64",
  "base64_desc_text_3": "I dati di input sono divisi in gruppi di tre byte (24 bit) ciascuno.",
  "base64_desc_text_4": "Ogni gruppo è quindi suddiviso in quattro pezzi da 6 bit.",
  "base64_desc_text_5": "Il valore decimale di ogni pezzo da 6 bit viene utilizzato come indice in una tabella di ricerca contenente i 64 caratteri utilizzati nella codifica Base64.",
  "base64_desc_text_6": "Il carattere corrispondente per ogni indice viene preso e concatenato insieme, risultando in una stringa di caratteri codificati Base64.",
  "base64_desc_text_7": "Se i dati di input non sono divisibili per tre, vengono aggiunti caratteri di riempimento ('=') alla fine per rendere la lunghezza totale un multiplo di quattro.",
  "base64_desc_text_8": "Decodifica con Base64",
  "base64_desc_text_9": "La stringa codificata Base64 viene suddivisa in gruppi di quattro caratteri.",
  "base64_desc_text_10": "Ogni carattere viene convertito nuovamente nella sua rappresentazione binaria a 6 bit utilizzando la tabella di ricerca.",
  "base64_desc_text_11": "I quattro pezzi da 6 bit risultanti vengono combinati per formare tre byte (24 bit).",
  "base64_desc_text_12": "Se sono presenti caratteri di riempimento ('='), vengono ignorati durante il processo di decodifica.",
  "base64_desc_text_13": "Il risultato finale sono i dati binari decodificati.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Immagini in WebP",
  "webp_keywords": "converti immagine in webp, converti immagini in webp, converti jpg in webp, converti gif in webp, converti png in webp, converti jpeg in webp, converti svg in webp, converti ico in webp, converti bmp in webp",
  "webp_description": "Converti immagini in WebP senza sforzo per prestazioni web più veloci e di alta qualità. Ideale per sviluppatori e web designer!",
  "webp_choose_files": "Scegli file",
  "webp_choose_files_more": "oppure trascina e rilascia .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp",
  "webp_download": "Scarica Webp",
  "webp_desc_title_1": "JPG in WebP",
  "webp_desc_text_1": "Converti le tue immagini .jpg nel moderno formato WebP senza sforzo. Ottimizza la dimensione dell'immagine e mantieni la qualità con il nostro strumento online. Inizia a convertire file .jpg in WebP ora!",
  "webp_desc_title_2": "GIF in WebP",
  "webp_desc_text_2": "Converti i tuoi file .gif nel formato WebP senza sforzo per prestazioni web ottimizzate. Riduci la dimensione del file senza compromettere la qualità dell'animazione. Converti .gif in WebP e migliora la tua esperienza web!",
  "webp_desc_title_3": "PNG in WebP",
  "webp_desc_text_3": "Converti le tue immagini .png nel formato WebP in modo efficiente. Mantieni la trasparenza e riduci la dimensione del file per un caricamento più veloce. Inizia a convertire file .png in WebP ora!",
  "webp_desc_title_4": "JPEG in WebP",
  "webp_desc_text_4": "Sperimenta prestazioni web più veloci convertendo i tuoi file .jpeg nel formato WebP. Mantieni la qualità dell'immagine riducendo la dimensione del file. Converti .jpeg in WebP e aumenta la velocità del tuo sito web!",
  "webp_desc_title_5": "SVG in WebP",
  "webp_desc_text_5": "Trasforma i tuoi file .svg nel formato WebP senza sforzo. Goditi dimensioni di file più piccole e una migliore compatibilità web. Inizia a convertire file .svg in WebP e migliora la tua esperienza web!",
  "webp_desc_title_6": "ICO in WebP",
  "webp_desc_text_6": "Ottimizza il tuo sito web convertendo i file .ico nel formato WebP efficiente. Riduci la dimensione del file senza compromettere la qualità delle icone. Converti .ico in WebP ora e migliora le prestazioni del tuo sito!",
  "webp_desc_title_7": "BMP in WebP",
  "webp_desc_text_7": "Converti le tue immagini .bmp nel moderno formato WebP senza sforzo. Goditi dimensioni di file più piccole e tempi di caricamento più veloci. Inizia a convertire file .bmp in WebP e ottimizza i tuoi contenuti web!",
  "info_size": "MB",
  "info_date": "Data di caricamento",
  "info_title_1": "Nome del pacchetto",
  "info_title_2": "Codice versione",
  "info_title_3": "Nome versione",
  "info_title_4": "ABI supportati",
  "info_title_5": "Librerie native",
  "info_title_6": "Versione minima Android supportata",
  "info_title_7": "SDK di destinazione",
  "info_title_8": "Attività",
  "info_title_9": "Servizi",
  "info_title_10": "Ricevitori di trasmissioni",
  "info_title_11": "Provider di contenuti",
  "info_title_12": "Autorizzazioni richieste",
  "info_title_13": "Identificativo del bundle",
  "info_title_14": "Versione del bundle",
  "info_title_15": "Versione minima del sistema operativo",
  "info_title_16": "Descrizione dell'uso della fotocamera",
  "info_title_17": "Descrizione dell'uso del microfono",
  "info_title_18": "Piattaforme supportate",
  "info_title_19": "Famiglia di dispositivi",
  "info_title_20": "Capacità richieste",
  "info_title_21": "Orientamenti supportati",
  "info_title_22": "Orientamenti supportati per iPad",
  "info_title_23": "Data di creazione della provisioning mobile",
  "info_title_24": "Nome del team",
  "info_title_25": "Endpoint URL",
  "info_title_26": "Endpoint IP",
  "info_tip_1": "Questi sono i punti di ingresso per interagire con l'utente. Ogni attività rappresenta una singola schermata con un'interfaccia utente.",
  "info_tip_2": "Questi sono componenti che funzionano in background per eseguire operazioni di lunga durata o per svolgere lavori per processi remoti.",
  "info_tip_3": "Questi sono componenti che rispondono agli annunci di trasmissione a livello di sistema. Non visualizzano un'interfaccia utente ma possono creare una notifica nella barra di stato.",
  "info_tip_4": "Gestiscono un insieme condiviso di dati dell'applicazione che è possibile memorizzare nel file system, in un database SQLite, sul web o in qualsiasi altra posizione di archiviazione persistente a cui l'app può accedere.",
  "info_tip_5": "Questo elenca le autorizzazioni che l'app richiede per accedere a dati sensibili o a funzionalità di sistema. Gli esempi includono l'accesso alla fotocamera, ai contatti, alla posizione, ecc.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Nessun dato",
  "not_found": "Questa pagina non è stata trovata.",
  "header_nav_4": "Decompilatore Java",
  "java_title": "Decompilatore Java Online",
  "java_description": "Ottimizza le tue app Java utilizzando il Decompilatore Java Online. Analizza, decompila e migliora il codice per aumentare le prestazioni e ottenere informazioni per una migliore esperienza utente e uno sviluppo semplificato.",
  "java_keywords": "decompilatore java, decompilatore java online, decompilatore apk, apk decompilato online, decompilatore jar online, decompilatore di classi java",
  "java_choose_files": "Scegli file",
  "java_choose_files_more": "oppure trascina e rilascia il tuo apk/jar/class qui",
  "java_faq": "FAQ",
  "java_faq_desc": "Trova le risposte alle domande più frequenti qui sotto",
  "java_faq_title_1": "Come funziona il Decompilatore Java Online?",
  "java_faq_text_1": "Il Decompilatore Java Online semplifica il processo: basta trascinare e rilasciare i tuoi file di classi Java per una decompilazione istantanea. Aspettati risultati di alta qualità senza problemi.",
  "java_faq_title_2": "Il processo di decompilazione è sicuro?",
  "java_faq_text_2": "Stai tranquillo, il Decompilatore Java Online dà priorità alla tua privacy. I file vengono memorizzati brevemente per la decompilazione e rapidamente eliminati, assicurando che i tuoi dati rimangano sicuri in ogni momento.",
  "java_faq_title_3": "Quali piattaforme sono supportate dal Decompilatore Java?",
  "java_faq_text_3": "Il Decompilatore Java Online funziona su tutte le piattaforme, inclusi Mac, Linux, Ubuntu e varie versioni di Windows. Goditi una decompilazione senza problemi indipendentemente dal tuo sistema operativo.",
  "java_faq_title_4": "Il processo di decompilazione è facile da usare?",
  "java_faq_text_4": "Il Decompilatore Java Online offre l'esperienza di decompilazione Java più semplice sul web, eliminando ogni curva di apprendimento. Goditi una decompilazione senza sforzo con solo pochi clic.",
  "java_faq_title_5": "Il processo di decompilazione richiede installazioni?",
  "java_faq_text_5": "Non sono necessarie installazioni. Il Decompilatore Java Online sfrutta la tecnologia cloud per una decompilazione rapida, garantendo un'esperienza senza problemi senza installazioni locali.",
  "java_faq_title_6": "Posso estrarre rapidamente i contenuti Jar utilizzando questa piattaforma?",
  "java_faq_text_6": "Assolutamente. La funzione di estrazione Jar del Decompilatore Java Online utilizza la tecnologia cloud per un'estrazione rapida. Goditi un'estrazione rapida ed efficiente dei contenuti Jar senza la necessità di installazioni aggiuntive.",
  "java_notice": "A causa delle dimensioni del file, il processo di caricamento potrebbe richiedere da 3 a 5 minuti. Grazie per la tua pazienza."
}