{
  "lang": "ms",
  "language": "Bahasa Melayu",
  "header_nav_1": "Penganalisis APK/IPA",
  "header_nav_2": "Pengekodan dan Penyahkodan Base64",
  "header_nav_3": "Imej ke webp",
  "footer_nav_1": "Tentang Kami",
  "footer_nav_2": "Keselamatan",
  "footer_nav_3": "Privasi",
  "footer_nav_4": "Syarat",
  "footer_nav_5": "Hubungi Kami",
  "copyright": "Hak Cipta Terpelihara",
  "title": "Penganalisis Apk Dalam Talian",
  "description": "Dengan alat Penganalisis Apk Dalam Talian kami, analisis dan optima APK Android anda untuk meningkatkan prestasi dan fungsi. Dapatkan pandangan dan cadangan terperinci untuk meningkatkan prestasi dan pengalaman pengguna aplikasi anda.",
  "keywords": "penganalisis apk, penganalisis apk dalam talian, analisis apk dalam talian, alat penganalisis apk, penganalisis rangkaian apk",
  "choose_files": "Pilih Fail",
  "choose_file_more": "atau seret dan lepaskan apk/ipa anda di sini",
  "index_desc_title_1": "Fungsi",
  "index_desc_text_1": "Pemeriksaan menyeluruh kandungan pakej APK termasuk kod aplikasi, fail sumber, MANIFEST, perpustakaan, kebenaran, keserasian perkakasan dan banyak lagi.",
  "index_desc_title_2": "Antara Muka Pengguna",
  "index_desc_text_2": "Papan pemuka bersih dan intuitif untuk memuat naik APK dan menavigasi data teknikal dan kebenaran yang diekstrak untuk pemeriksaan.",
  "index_desc_title_3": "Keselamatan",
  "index_desc_text_3": "Fail dilindungi dengan penyulitan SSL 256-bit dan secara automatik dipadamkan selepas 2 jam untuk memastikan kerahsiaan.",
  "index_desc_title_4": "Kos",
  "index_desc_text_4": "Perkhidmatan 100% percuma dengan muat naik APK tanpa had dan penyimpanan data. Komuniti sumber terbuka kami menanggung kos pelayan dan penyimpanan.",
  "index_apk_title": "APK (Pakej Aplikasi Android)",
  "index_apk_desc": "APK (Pakej Aplikasi Android) ialah format fail yang digunakan untuk mengedarkan dan memasang aplikasi pada peranti Android. Ia mengandungi semua fail dan sumber yang diperlukan untuk menjalankan aplikasi pada platform Android. Fail APK termasuk kod aplikasi, aset, fail manifest dan sijil. Ia membolehkan pengguna memuat turun dan memasang aplikasi dengan mudah dari pelbagai sumber. Fail APK terutamanya digunakan pada peranti Android dan boleh dipasang secara langsung atau melalui gedung aplikasi seperti Google Play.",
  "index_ipa_title": "IPA (Pakej App Store iOS)",
  "index_ipa_desc": "IPA (Pakej App Store iOS) ialah format fail yang digunakan untuk mengedarkan dan memasang aplikasi pada peranti iOS. Ia mengandungi kod binari yang dikompilasi, sumber dan metadata yang diperlukan untuk menjalankan aplikasi pada iPhone, iPad atau iPod Touch. Fail IPA dicipta apabila aplikasi iOS dikompilasi dan ditandatangani oleh pembangun. Ia boleh dipasang pada peranti iOS melalui iTunes atau melalui kaedah pemasangan over-the-air seperti TestFlight Apple. Fail IPA adalah khusus untuk peranti iOS dan hanya boleh dipasang pada peranti yang menjalankan iOS.",
  "base64_title": "Pengekodan dan Penyahkodan Base64",
  "base64_keywords": "base64 ke fail, fail ke base64, tukar fail ke base64, penyahkod base64 ke fail, base64 ke fail dalam talian",
  "base64_description": "Kod dan nyahkod data dengan mudah ke dan dari format Base64 menggunakan alat dalam talian kami. Tukar teks, imej atau fail ke Base64 untuk penghantaran atau penyimpanan data yang selamat. Nyahkod rentetan Base64 ke format asalnya.",
  "base64_encode": "Kod Base64",
  "base64_decode": "Nyahkod Base64",
  "base64_select_text": "Pilih jenis",
  "base64_select_text_2": "Pilih sambungan fail",
  "base64_encode_input_placeholder": "Masukkan rentetan Base64 yang dinyahkod",
  "base64_encode_result_placeholder": "Cari hasil di sini...",
  "base64_encode_btn": "Kod",
  "base64_decode_input_placeholder": "Masukkan rentetan Base64 yang dikodkan",
  "base64_decode_result_placeholder": "Cari hasil di sini...",
  "base64_decode_btn": "Nyahkod",
  "base64_choose_files": "Pilih Fail",
  "base64_choose_file_more": "atau seret dan lepaskan fail anda di sini",
  "base64_result": "Hasil pengekodan Base64 akan muncul di sini",
  "base64_copy": "salin",
  "base64_clear": "kosongkan",
  "base64_download": "muat turun",
  "base64_desc_text_1": "Base64 ialah skema pengekodan binari ke teks yang menukar data binari kepada format yang selamat untuk penghantaran melalui protokol berasaskan teks, seperti e-mel atau HTTP. Ia mencapainya dengan mewakili data binari menggunakan set 64 aksara ASCII yang boleh dicetak.",
  "base64_desc_text_2": "Pengekodan dengan Base64",
  "base64_desc_text_3": "Data input dibahagikan kepada kumpulan tiga bait (24 bit) setiap satu.",
  "base64_desc_text_4": "Setiap kumpulan kemudian dibahagikan kepada empat keping 6-bit.",
  "base64_desc_text_5": "Nilai perpuluhan setiap keping 6-bit digunakan sebagai indeks dalam jadual carian yang mengandungi 64 aksara yang digunakan dalam pengekodan Base64.",
  "base64_desc_text_6": "Aksara yang sepadan untuk setiap indeks diambil dan digabungkan bersama, menghasilkan rentetan aksara yang dikodkan dengan Base64.",
  "base64_desc_text_7": "Jika data input tidak boleh dibahagikan dengan tiga, aksara padding ('=') ditambah pada penghujungnya untuk menjadikan jumlah panjangnya gandaan empat.",
  "base64_desc_text_8": "Penyahkodan dengan Base64",
  "base64_desc_text_9": "Rentetan yang dikodkan dengan Base64 dibahagikan kepada kumpulan empat aksara.",
  "base64_desc_text_10": "Setiap aksara ditukar kembali kepada perwakilan binari 6-bitnya menggunakan jadual carian.",
  "base64_desc_text_11": "Empat keping 6-bit yang terhasil digabungkan untuk membentuk tiga bait (24 bit).",
  "base64_desc_text_12": "Jika terdapat aksara padding ('='), ia diabaikan semasa proses penyahkodan.",
  "base64_desc_text_13": "Hasil akhir ialah data binari yang dinyahkod.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Imej ke WebP",
  "webp_keywords": "tukar imej ke webp, tukar gambar ke webp, tukar jpg ke webp, tukar gif ke webp, tukar png ke webp, tukar jpeg ke webp, tukar svg ke webp, tukar ico ke webp, tukar bmp ke webp",
  "webp_description": "Tukar imej ke WebP dengan mudah untuk prestasi web yang lebih pantas dan berkualiti tinggi. Sesuai untuk pembangun dan pereka web!",
  "webp_choose_files": "Pilih Fail",
  "webp_choose_files_more": "atau seret dan lepaskan .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp di sini",
  "webp_download": "Muat Turun Webp",
  "webp_desc_title_1": "JPG ke WebP",
  "webp_desc_text_1": "Tukar imej .jpg anda ke format WebP moden dengan mudah. Optimumkan saiz imej dan kekalkan kualiti menggunakan alat dalam talian kami. Mula menukar fail .jpg ke WebP sekarang!",
  "webp_desc_title_2": "GIF ke WebP",
  "webp_desc_text_2": "Tukar fail .gif anda ke format WebP dengan mudah untuk prestasi web yang dioptimumkan. Kurangkan saiz fail tanpa menjejaskan kualiti animasi. Tukar .gif ke WebP dan tingkatkan pengalaman web anda!",
  "webp_desc_title_3": "PNG ke WebP",
  "webp_desc_text_3": "Tukar imej .png anda ke format WebP yang cekap dengan mudah. Kekalkan ketelusan dan kurangkan saiz fail untuk pemuatan yang lebih pantas. Mula menukar fail .png ke WebP sekarang!",
  "webp_desc_title_4": "JPEG ke WebP",
  "webp_desc_text_4": "Alami prestasi web yang lebih pantas dengan menukar fail .jpeg anda ke format WebP. Kekalkan kualiti imej sambil mengurangkan saiz fail. Tukar .jpeg ke WebP dan tingkatkan kelajuan laman web anda!",
  "webp_desc_title_5": "SVG ke WebP",
  "webp_desc_text_5": "Tukar fail .svg anda ke format WebP dengan mudah. Nikmati saiz fail yang lebih kecil dan keserasian web yang lebih baik. Mula menukar fail .svg ke WebP dan tingkatkan pengalaman web anda!",
  "webp_desc_title_6": "ICO ke WebP",
  "webp_desc_text_6": "Optimumkan laman web anda dengan menukar fail .ico ke format WebP yang cekap. Kurangkan saiz fail tanpa menjejaskan kualiti ikon. Tukar .ico ke WebP sekarang dan tingkatkan prestasi laman web anda!",
  "webp_desc_title_7": "BMP ke WebP",
  "webp_desc_text_7": "Tukar imej .bmp anda ke format WebP moden dengan mudah. Nikmati saiz fail yang lebih kecil dan masa pemuatan yang lebih pantas. Mula menukar fail .bmp ke WebP dan optimumkan kandungan web anda!",
  "info_size": "MB",
  "info_date": "Tarikh Muat Naik",
  "info_title_1": "Nama Pakej",
  "info_title_2": "Kod Versi",
  "info_title_3": "Nama Versi",
  "info_title_4": "ABI Disokong",
  "info_title_5": "Perpustakaan Asli",
  "info_title_6": "Versi Minimum Android Disokong",
  "info_title_7": "SDK Sasaran",
  "info_title_8": "Aktiviti",
  "info_title_9": "Perkhidmatan",
  "info_title_10": "Penerima Siaran",
  "info_title_11": "Penyedia Kandungan",
  "info_title_12": "Kebenaran yang Diminta",
  "info_title_13": "Pengenal Bundle",
  "info_title_14": "Versi Bundle",
  "info_title_15": "Versi Minimum OS",
  "info_title_16": "Penerangan Penggunaan Kamera",
  "info_title_17": "Penerangan Penggunaan Mikrofon",
  "info_title_18": "Platform Disokong",
  "info_title_19": "Keluarga Peranti",
  "info_title_20": "Keupayaan Diperlukan",
  "info_title_21": "Orientasi Disokong",
  "info_title_22": "Orientasi iPad Disokong",
  "info_title_23": "Tarikh Penciptaan Provisioning Mudah Alih",
  "info_title_24": "Nama Pasukan",
  "info_title_25": "Titik Akhir URL",
  "info_title_26": "Titik Akhir IP",
  "info_tip_1": "Ini adalah titik masuk untuk berinteraksi dengan pengguna. Setiap aktiviti mewakili satu skrin dengan antara muka pengguna.",
  "info_tip_2": "Ini adalah komponen yang berjalan di latar belakang untuk melaksanakan operasi jangka panjang atau untuk melakukan kerja untuk proses jauh.",
  "info_tip_3": "Ini adalah komponen yang bertindak balas kepada pengumuman siaran di seluruh sistem. Mereka tidak memaparkan antara muka pengguna tetapi boleh membuat pemberitahuan dalam bar status.",
  "info_tip_4": "Ini menguruskan satu set data aplikasi yang dikongsi yang boleh anda simpan dalam sistem fail, pangkalan data SQLite, web atau lokasi penyimpanan tetap lain yang boleh diakses oleh aplikasi anda.",
  "info_tip_5": "Ini menyenaraikan kebenaran yang diminta oleh aplikasi untuk mengakses data sensitif atau ciri sistem. Contoh termasuk akses kepada kamera, kenalan, lokasi, dll.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Tiada data",
  "not_found": "Halaman ini tidak dapat dijumpai.",
  "header_nav_4": "Decompiler Java",
  "java_title": "Decompiler Java Dalam Talian",
  "java_description": "Optimumkan aplikasi Java anda menggunakan Decompiler Java Dalam Talian. Analisis, dekompil dan tingkatkan kod untuk meningkatkan prestasi dan mendapatkan wawasan untuk pengalaman pengguna yang lebih baik dan pembangunan yang dipermudahkan.",
  "java_keywords": "decompiler java, decompiler java dalam talian, decompiler apk, apk yang telah didekompil dalam talian, decompiler jar dalam talian, decompiler kelas java",
  "java_choose_files": "Pilih Fail",
  "java_choose_files_more": "atau seret dan lepaskan apk/jar/class anda di sini",
  "java_faq": "FAQ",
  "java_faq_desc": "Cari jawapan kepada soalan yang paling kerap ditanya di bawah",
  "java_faq_title_1": "Bagaimana Decompiler Java Dalam Talian berfungsi?",
  "java_faq_text_1": "Decompiler Java Dalam Talian mempermudah proses - cukup seret dan lepaskan fail kelas Java anda untuk dekompilasi segera. Jangkakan hasil berkualiti tinggi tanpa kesulitan.",
  "java_faq_title_2": "Adakah proses dekompilasi selamat?",
  "java_faq_text_2": "Yakinlah, Decompiler Java Dalam Talian mengutamakan privasi anda. Fail disimpan sementara untuk dekompilasi dan segera dipadamkan, memastikan data anda sentiasa selamat.",
  "java_faq_title_3": "Platform apa yang disokong oleh Decompiler Java?",
  "java_faq_text_3": "Decompiler Java Dalam Talian berfungsi pada semua platform, termasuk Mac, Linux, Ubuntu dan pelbagai versi Windows. Nikmati dekompilasi tanpa masalah tanpa mengira sistem operasi anda.",
  "java_faq_title_4": "Adakah proses dekompilasi mudah digunakan?",
  "java_faq_text_4": "Decompiler Java Dalam Talian menawarkan pengalaman dekompilasi Java yang paling mudah di web, menghapuskan sebarang keluk pembelajaran. Nikmati dekompilasi tanpa usaha dengan hanya beberapa klik.",
  "java_faq_title_5": "Adakah proses dekompilasi memerlukan pemasangan?",
  "java_faq_text_5": "Tiada pemasangan diperlukan. Decompiler Java Dalam Talian menggunakan teknologi awan untuk dekompilasi pantas, memastikan pengalaman tanpa masalah tanpa pemasangan tempatan.",
  "java_faq_title_6": "Bolehkah saya mengekstrak kandungan Jar dengan cepat menggunakan platform ini?",
  "java_faq_text_6": "Sudah tentu. Fungsi ekstraksi Jar Decompiler Java Dalam Talian menggunakan teknologi awan untuk ekstraksi pantas. Nikmati ekstraksi kandungan Jar yang cepat dan cekap tanpa perlu pemasangan tambahan.",
  "java_notice": "Disebabkan saiz fail, proses muat naik mungkin mengambil masa 3 hingga 5 minit. Terima kasih atas kesabaran anda."
}