{
  "lang": "pt",
  "language": "Português",
  "header_nav_1": "Analisador APK/IPA",
  "header_nav_2": "Codificação e Decodificação Base64",
  "header_nav_3": "Imagem para webp",
  "footer_nav_1": "Sobre Nós",
  "footer_nav_2": "Segurança",
  "footer_nav_3": "Privacidade",
  "footer_nav_4": "Termos",
  "footer_nav_5": "Contato",
  "copyright": "Todos os direitos reservados",
  "title": "Analisador de APK Online",
  "description": "Com nossa ferramenta Analisador de APK Online, analise e otimize seus APKs Android para melhorar o desempenho e a funcionalidade. Obtenha insights e recomendações detalhadas para melhorar o desempenho e a experiência do usuário do seu aplicativo.",
  "keywords": "analisador de apk, analisador de apk online, analisar apk online, ferramenta de análise de apk, analisador de rede apk",
  "choose_files": "Escolher arquivos",
  "choose_file_more": "ou arraste e solte seu apk/ipa aqui",
  "index_desc_title_1": "Funcionalidade",
  "index_desc_text_1": "Inspeção completa do conteúdo do pacote APK, incluindo código do aplicativo, arquivos de recursos, MANIFEST, bibliotecas, permissões, compatibilidade de hardware e muito mais.",
  "index_desc_title_2": "Interface do Usuário",
  "index_desc_text_2": "Painéis limpos e intuitivos para fazer upload de APKs e navegar pelos dados técnicos e de permissões extraídos para inspeção.",
  "index_desc_title_3": "Segurança",
  "index_desc_text_3": "Os arquivos são protegidos com criptografia SSL de 256 bits e são automaticamente excluídos após 2 horas para garantir a confidencialidade.",
  "index_desc_title_4": "Custo",
  "index_desc_text_4": "Serviço 100% gratuito com uploads de APK e armazenamento de dados ilimitados. Nossa comunidade de código aberto cobre os custos de servidor e armazenamento.",
  "index_apk_title": "APK (Pacote de Aplicativo Android)",
  "index_apk_desc": "APK (Pacote de Aplicativo Android) é o formato de arquivo usado para distribuir e instalar aplicativos em dispositivos Android. Ele contém todos os arquivos e recursos necessários para que o aplicativo funcione em uma plataforma Android. Um arquivo APK inclui o código do aplicativo, recursos, o arquivo de manifesto e certificados. Permite que os usuários baixem e instalem aplicativos facilmente de várias fontes. Os arquivos APK são usados principalmente em dispositivos Android e podem ser instalados diretamente ou através de lojas de aplicativos como o Google Play.",
  "index_ipa_title": "IPA (Pacote da App Store iOS)",
  "index_ipa_desc": "IPA (Pacote da App Store iOS) é o formato de arquivo usado para distribuir e instalar aplicativos em dispositivos iOS. Ele contém o código binário compilado, recursos e metadados necessários para que o aplicativo funcione em um iPhone, iPad ou iPod Touch. Um arquivo IPA é criado quando um aplicativo iOS é compilado e assinado pelo desenvolvedor. Pode ser instalado em dispositivos iOS através do iTunes ou por meio de métodos de instalação over-the-air, como o TestFlight da Apple. Os arquivos IPA são específicos para dispositivos iOS e só podem ser instalados em dispositivos que executam iOS.",
  "base64_title": "Codificação e Decodificação Base64",
  "base64_keywords": "base64 para arquivo, arquivo para base64, converter arquivo para base64, decodificar base64 para arquivo, base64 para arquivo online",
  "base64_description": "Codifique e decodifique dados facilmente para e do formato Base64 com nossa ferramenta online. Converta textos, imagens ou arquivos para Base64 para transmissão ou armazenamento seguro de dados. Decodifique cadeias Base64 para seu formato original.",
  "base64_encode": "Codificar Base64",
  "base64_decode": "Decodificar Base64",
  "base64_select_text": "Selecione o tipo",
  "base64_select_text_2": "Selecione a extensão do arquivo",
  "base64_encode_input_placeholder": "Insira a cadeia Base64 decodificada",
  "base64_encode_result_placeholder": "Encontre o resultado aqui...",
  "base64_encode_btn": "Codificar",
  "base64_decode_input_placeholder": "Insira a cadeia Base64 codificada",
  "base64_decode_result_placeholder": "Encontre o resultado aqui...",
  "base64_decode_btn": "Decodificar",
  "base64_choose_files": "Escolher arquivos",
  "base64_choose_file_more": "ou arraste e solte seu arquivo aqui",
  "base64_result": "O resultado da codificação Base64 aparecerá aqui",
  "base64_copy": "copiar",
  "base64_clear": "limpar",
  "base64_download": "baixar",
  "base64_desc_text_1": "Base64 é um esquema de codificação binário-para-texto que converte dados binários em um formato seguro para transmissão através de protocolos baseados em texto, como e-mail ou HTTP. Ele consegue isso representando dados binários usando um conjunto de 64 caracteres ASCII imprimíveis.",
  "base64_desc_text_2": "Codificação com Base64",
  "base64_desc_text_3": "Os dados de entrada são divididos em grupos de três bytes (24 bits) cada.",
  "base64_desc_text_4": "Cada grupo é então dividido em quatro pedaços de 6 bits.",
  "base64_desc_text_5": "O valor decimal de cada pedaço de 6 bits é usado como índice em uma tabela de consulta que contém os 64 caracteres usados na codificação Base64.",
  "base64_desc_text_6": "O caractere correspondente para cada índice é pego e concatenado, resultando em uma cadeia de caracteres codificados em Base64.",
  "base64_desc_text_7": "Se os dados de entrada não forem divisíveis por três, caracteres de preenchimento ('=') são adicionados ao final para que o comprimento total seja um múltiplo de quatro.",
  "base64_desc_text_8": "Decodificação com Base64",
  "base64_desc_text_9": "A cadeia codificada em Base64 é dividida em grupos de quatro caracteres.",
  "base64_desc_text_10": "Cada caractere é convertido de volta para sua representação binária de 6 bits usando a tabela de consulta.",
  "base64_desc_text_11": "Os quatro pedaços de 6 bits resultantes são combinados para formar três bytes (24 bits).",
  "base64_desc_text_12": "Se houver caracteres de preenchimento ('='), eles são ignorados durante o processo de decodificação.",
  "base64_desc_text_13": "O resultado final são os dados binários decodificados.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Imagens para WebP",
  "webp_keywords": "converter imagem para webp, converter imagens para webp, converter jpg para webp, converter gif para webp, converter png para webp, converter jpeg para webp, converter svg para webp, converter ico para webp, converter bmp para webp",
  "webp_description": "Converta imagens para WebP facilmente para um desempenho web mais rápido e de alta qualidade. Ideal para desenvolvedores e designers web!",
  "webp_choose_files": "Escolher arquivos",
  "webp_choose_files_more": "ou arraste e solte .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp",
  "webp_download": "Baixar Webp",
  "webp_desc_title_1": "JPG para WebP",
  "webp_desc_text_1": "Converta suas imagens .jpg para o moderno formato WebP facilmente. Otimize o tamanho da imagem e mantenha a qualidade com nossa ferramenta online. Comece a converter arquivos .jpg para WebP agora!",
  "webp_desc_title_2": "GIF para WebP",
  "webp_desc_text_2": "Converta seus arquivos .gif para o formato WebP facilmente para um desempenho web otimizado. Reduza o tamanho do arquivo sem comprometer a qualidade da animação. Converta .gif para WebP e melhore sua experiência web!",
  "webp_desc_title_3": "PNG para WebP",
  "webp_desc_text_3": "Converta suas imagens .png para o formato WebP de forma eficiente. Mantenha a transparência e reduza o tamanho do arquivo para carregamentos mais rápidos. Comece a converter arquivos .png para WebP agora!",
  "webp_desc_title_4": "JPEG para WebP",
  "webp_desc_text_4": "Experimente um desempenho web mais rápido convertendo seus arquivos .jpeg para o formato WebP. Mantenha a qualidade da imagem enquanto reduz o tamanho do arquivo. Converta .jpeg para WebP e aumente a velocidade do seu site!",
  "webp_desc_title_5": "SVG para WebP",
  "webp_desc_text_5": "Transforme seus arquivos .svg para o formato WebP facilmente. Aproveite tamanhos de arquivo menores e melhor compatibilidade web. Comece a converter arquivos .svg para WebP e melhore sua experiência web!",
  "webp_desc_title_6": "ICO para WebP",
  "webp_desc_text_6": "Otimize seu site convertendo arquivos .ico para o eficiente formato WebP. Reduza o tamanho do arquivo sem comprometer a qualidade do ícone. Converta .ico para WebP agora e melhore o desempenho do seu site!",
  "webp_desc_title_7": "BMP para WebP",
  "webp_desc_text_7": "Converta suas imagens .bmp para o moderno formato WebP facilmente. Aproveite tamanhos de arquivo menores e tempos de carregamento mais rápidos. Comece a converter arquivos .bmp para WebP e otimize seu conteúdo web!",
  "info_size": "MB",
  "info_date": "Data de Upload",
  "info_title_1": "Nome do Pacote",
  "info_title_2": "Código de Versão",
  "info_title_3": "Nome da Versão",
  "info_title_4": "ABIs Suportadas",
  "info_title_5": "Bibliotecas Nativas",
  "info_title_6": "Versão Android Mínima Suportada",
  "info_title_7": "SDK de Destino",
  "info_title_8": "Atividades",
  "info_title_9": "Serviços",
  "info_title_10": "Receptores de Transmissão",
  "info_title_11": "Provedores de Conteúdo",
  "info_title_12": "Permissões Solicitadas",
  "info_title_13": "Identificador do Pacote",
  "info_title_14": "Versão do Pacote",
  "info_title_15": "Versão Mínima do OS",
  "info_title_16": "Descrição do Uso da Câmera",
  "info_title_17": "Descrição do Uso do Microfone",
  "info_title_18": "Plataformas Suportadas",
  "info_title_19": "Família de Dispositivos",
  "info_title_20": "Capacidades Necessárias",
  "info_title_21": "Orientações Suportadas",
  "info_title_22": "Orientações Suportadas para iPad",
  "info_title_23": "Data de Criação do Provisionamento Móvel",
  "info_title_24": "Nome da Equipe",
  "info_title_25": "Endpoints URL",
  "info_title_26": "Endpoints IP",
  "info_tip_1": "Estes são os pontos de entrada para interagir com o usuário. Cada atividade representa uma única tela com uma interface de usuário.",
  "info_tip_2": "Estes são componentes que são executados em segundo plano para realizar operações de longa duração ou para realizar trabalhos para processos remotos.",
  "info_tip_3": "Estes são componentes que respondem a anúncios de transmissão em nível de sistema. Eles não exibem uma interface de usuário, mas podem criar uma notificação na barra de status.",
  "info_tip_4": "Eles gerenciam um conjunto compartilhado de dados de aplicativos que você pode armazenar no sistema de arquivos, em um banco de dados SQLite, na web ou em qualquer outro local de armazenamento persistente ao qual seu aplicativo pode acessar.",
  "info_tip_5": "Isso lista as permissões que o aplicativo solicita para acessar dados sensíveis ou recursos do sistema. Exemplos incluem acesso à câmera, contatos, localização, etc.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Sem dados",
  "not_found": "Esta página não foi encontrada.",
  "header_nav_4": "Descompilador Java",
  "java_title": "Descompilador Java Online",
  "java_description": "Otimize seus aplicativos Java usando o Descompilador Java Online. Analise, descompile e melhore o código para aumentar o desempenho e obter insights para uma melhor experiência do usuário e um desenvolvimento otimizado.",
  "java_keywords": "descompilador java, descompilador java online, descompilador apk, apk descompilado online, descompilador jar online, descompilador de classe java",
  "java_choose_files": "Escolher arquivos",
  "java_choose_files_more": "ou arraste e solte seu apk/jar/class aqui",
  "java_faq": "FAQ",
  "java_faq_desc": "Encontre abaixo as respostas para as perguntas mais frequentes",
  "java_faq_title_1": "Como funciona o Descompilador Java Online?",
  "java_faq_text_1": "O Descompilador Java Online simplifica o processo - basta arrastar e soltar seus arquivos de classe Java para descompilação instantânea. Espere resultados de alta qualidade sem complicações.",
  "java_faq_title_2": "O processo de descompilação é seguro?",
  "java_faq_text_2": "Fique tranquilo, o Descompilador Java Online prioriza sua privacidade. Os arquivos são armazenados brevemente para descompilação e rapidamente excluídos, garantindo que seus dados permaneçam seguros o tempo todo.",
  "java_faq_title_3": "Quais plataformas são suportadas pelo Descompilador Java?",
  "java_faq_text_3": "O Descompilador Java Online funciona em todas as plataformas, incluindo Mac, Linux, Ubuntu e várias versões do Windows. Desfrute de uma descompilação sem problemas, independentemente do seu sistema operacional.",
  "java_faq_title_4": "O processo de descompilação é fácil de usar?",
  "java_faq_text_4": "O Descompilador Java Online oferece a experiência de descompilação Java mais simples da web, eliminando qualquer curva de aprendizado. Desfrute de uma descompilação sem esforço com apenas alguns cliques.",
  "java_faq_title_5": "O processo de descompilação requer instalações?",
  "java_faq_text_5": "Nenhuma instalação é necessária. O Descompilador Java Online utiliza tecnologia em nuvem para descompilação rápida, garantindo uma experiência sem complicações sem instalações locais.",
  "java_faq_title_6": "Posso extrair rapidamente o conteúdo do Jar usando esta plataforma?",
  "java_faq_text_6": "Absolutamente. A função de extração Jar do Descompilador Java Online utiliza tecnologia em nuvem para extração rápida. Desfrute de uma extração rápida e eficiente do conteúdo do Jar sem a necessidade de instalações adicionais.",
  "java_notice": "Devido ao tamanho do arquivo, o processo de upload pode levar de 3 a 5 minutos. Obrigado pela sua paciência."
}