{
  "lang": "ru",
  "language": "Русский",
  "header_nav_1": "Анализатор APK/IPA",
  "header_nav_2": "Кодирование и декодирование Base64",
  "header_nav_3": "Изображение в webp",
  "footer_nav_1": "О нас",
  "footer_nav_2": "Безопасность",
  "footer_nav_3": "Конфиденциальность",
  "footer_nav_4": "Условия",
  "footer_nav_5": "Контакты",
  "copyright": "Все права защищены",
  "title": "Онлайн-анализатор APK",
  "description": "С помощью нашего онлайн-инструмента для анализа APK вы можете анализировать и оптимизировать APK-файлы Android, чтобы улучшить производительность и функциональность. Получите подробные рекомендации и инсайты для повышения производительности и улучшения пользовательского опыта вашего приложения.",
  "keywords": "анализатор apk, онлайн-анализатор apk, анализ apk онлайн, инструмент для анализа apk, сетевой анализатор apk",
  "choose_files": "Выбрать файлы",
  "choose_file_more": "или перетащите ваш apk/ipa сюда",
  "index_desc_title_1": "Функциональность",
  "index_desc_text_1": "Полная проверка содержимого пакета APK, включая код приложения, файлы ресурсов, MANIFEST, библиотеки, разрешения, совместимость с оборудованием и многое другое.",
  "index_desc_title_2": "Интерфейс пользователя",
  "index_desc_text_2": "Чистые и интуитивно понятные панели для загрузки APK-файлов и навигации по извлеченным техническим данным и разрешениям для проверки.",
  "index_desc_title_3": "Безопасность",
  "index_desc_text_3": "Файлы защищены 256-битным шифрованием SSL и автоматически удаляются через 2 часа для обеспечения конфиденциальности.",
  "index_desc_title_4": "Стоимость",
  "index_desc_text_4": "100% бесплатный сервис с неограниченными загрузками APK и хранением данных. Наше сообщество с открытым исходным кодом покрывает расходы на серверы и хранилища.",
  "index_apk_title": "APK (Пакет приложений Android)",
  "index_apk_desc": "APK (Пакет приложений Android) — это формат файла, используемый для распространения и установки приложений на устройствах Android. Он содержит все файлы и ресурсы, необходимые для работы приложения на платформе Android. Файл APK включает код приложения, активы, файл манифеста и сертификаты. Это позволяет пользователям легко загружать и устанавливать приложения из различных источников. Файлы APK используются в основном на устройствах Android и могут быть установлены напрямую или через магазины приложений, такие как Google Play.",
  "index_ipa_title": "IPA (Пакет App Store iOS)",
  "index_ipa_desc": "IPA (Пакет App Store iOS) — это формат файла, используемый для распространения и установки приложений на устройствах iOS. Он содержит скомпилированный бинарный код, ресурсы и метаданные, необходимые для работы приложения на iPhone, iPad или iPod Touch. Файл IPA создается, когда iOS-приложение компилируется и подписывается разработчиком. Его можно установить на устройства iOS через iTunes или через методы установки по воздуху, такие как TestFlight от Apple. Файлы IPA специфичны для устройств iOS и могут быть установлены только на устройствах с iOS.",
  "base64_title": "Кодирование и декодирование Base64",
  "base64_keywords": "base64 в файл, файл в base64, конвертировать файл в base64, декодировать base64 в файл, base64 в файл онлайн",
  "base64_description": "Легко кодируйте и декодируйте данные в формате Base64 с помощью нашего онлайн-инструмента. Конвертируйте тексты, изображения или файлы в Base64 для безопасной передачи или хранения данных. Декодируйте строки Base64 в их исходный формат.",
  "base64_encode": "Кодировать Base64",
  "base64_decode": "Декодировать Base64",
  "base64_select_text": "Выберите тип",
  "base64_select_text_2": "Выберите расширение файла",
  "base64_encode_input_placeholder": "Введите декодированную строку Base64",
  "base64_encode_result_placeholder": "Результат будет здесь...",
  "base64_encode_btn": "Кодировать",
  "base64_decode_input_placeholder": "Введите закодированную строку Base64",
  "base64_decode_result_placeholder": "Результат будет здесь...",
  "base64_decode_btn": "Декодировать",
  "base64_choose_files": "Выбрать файлы",
  "base64_choose_file_more": "или перетащите ваш файл сюда",
  "base64_result": "Результат кодирования Base64 будет здесь",
  "base64_copy": "копировать",
  "base64_clear": "очистить",
  "base64_download": "скачать",
  "base64_desc_text_1": "Base64 — это схема кодирования двоичных данных в текст, которая преобразует двоичные данные в безопасный для передачи через текстовые протоколы, такие как электронная почта или HTTP, формат. Это достигается путем представления двоичных данных с использованием набора из 64 печатных символов ASCII.",
  "base64_desc_text_2": "Кодирование с помощью Base64",
  "base64_desc_text_3": "Входные данные делятся на группы по три байта (24 бита) каждая.",
  "base64_desc_text_4": "Каждая группа затем делится на четыре части по 6 бит.",
  "base64_desc_text_5": "Десятичное значение каждой 6-битной части используется в качестве индекса в таблице поиска, содержащей 64 символа, используемых в кодировании Base64.",
  "base64_desc_text_6": "Соответствующий символ для каждого индекса выбирается и объединяется, что приводит к строке символов, закодированных в Base64.",
  "base64_desc_text_7": "Если входные данные не делятся на три, в конце добавляются символы заполнения ('='), чтобы общая длина была кратной четырем.",
  "base64_desc_text_8": "Декодирование с помощью Base64",
  "base64_desc_text_9": "Закодированная в Base64 строка делится на группы по четыре символа.",
  "base64_desc_text_10": "Каждый символ преобразуется обратно в свое 6-битное двоичное представление с использованием таблицы поиска.",
  "base64_desc_text_11": "Полученные четыре 6-битные части объединяются, образуя три байта (24 бита).",
  "base64_desc_text_12": "Если присутствуют символы заполнения ('='), они игнорируются в процессе декодирования.",
  "base64_desc_text_13": "Конечный результат — это декодированные двоичные данные.",
  "base64_desc_text_14": "",
  "base64_desc_text_15": "",
  "base64_desc_text_16": "",
  "base64_desc_text_17": "",
  "base64_desc_text_18": "",
  "base64_desc_text_19": "",
  "base64_desc_text_20": "",
  "webp_title": "Изображения в WebP",
  "webp_keywords": "конвертировать изображение в webp, конвертировать изображения в webp, конвертировать jpg в webp, конвертировать gif в webp, конвертировать png в webp, конвертировать jpeg в webp, конвертировать svg в webp, конвертировать ico в webp, конвертировать bmp в webp",
  "webp_description": "Легко конвертируйте изображения в WebP для более быстрого и качественного веб-опыта. Идеально подходит для разработчиков и веб-дизайнеров!",
  "webp_choose_files": "Выбрать файлы",
  "webp_choose_files_more": "или перетащите сюда .jpg, .gif, .png, .jpeg, .svg, .ico, .bmp",
  "webp_download": "Скачать Webp",
  "webp_desc_title_1": "JPG в WebP",
  "webp_desc_text_1": "Легко конвертируйте свои изображения .jpg в современный формат WebP. Оптимизируйте размер изображения и сохраните качество с помощью нашего онлайн-инструмента. Начните конвертацию файлов .jpg в WebP сейчас!",
  "webp_desc_title_2": "GIF в WebP",
  "webp_desc_text_2": "Легко конвертируйте свои файлы .gif в формат WebP для оптимизированного веб-опыта. Уменьшите размер файла без ущерба для качества анимации. Конвертируйте .gif в WebP и улучшите свой веб-опыт!",
  "webp_desc_title_3": "PNG в WebP",
  "webp_desc_text_3": "Легко конвертируйте свои изображения .png в эффективный формат WebP. Сохраняйте прозрачность и уменьшайте размер файла для более быстрого загрузки. Начните конвертацию файлов .png в WebP сейчас!",
  "webp_desc_title_4": "JPEG в WebP",
  "webp_desc_text_4": "Испытайте более быструю работу в интернете, конвертируя свои файлы .jpeg в формат WebP. Сохраните качество изображения при уменьшении размера файла. Конвертируйте .jpeg в WebP и увеличьте скорость вашего сайта!",
  "webp_desc_title_5": "SVG в WebP",
  "webp_desc_text_5": "Легко преобразуйте свои файлы .svg в формат WebP. Наслаждайтесь меньшими размерами файлов и лучшей совместимостью с веб. Начните конвертацию файлов .svg в WebP и улучшите свой веб-опыт!",
  "webp_desc_title_6": "ICO в WebP",
  "webp_desc_text_6": "Оптимизируйте свой сайт, конвертируя файлы .ico в эффективный формат WebP. Уменьшите размер файла без ущерба для качества иконок. Конвертируйте .ico в WebP сейчас и улучшите производительность своего сайта!",
  "webp_desc_title_7": "BMP в WebP",
  "webp_desc_text_7": "Легко конвертируйте свои изображения .bmp в современный формат WebP. Наслаждайтесь меньшими размерами файлов и более быстрыми временами загрузки. Начните конвертацию файлов .bmp в WebP и оптимизируйте свой веб-контент!",
  "info_size": "MB",
  "info_date": "Дата загрузки",
  "info_title_1": "Имя пакета",
  "info_title_2": "Код версии",
  "info_title_3": "Имя версии",
  "info_title_4": "Поддерживаемые ABI",
  "info_title_5": "Родные библиотеки",
  "info_title_6": "Минимальная поддерживаемая версия Android",
  "info_title_7": "Целевой SDK",
  "info_title_8": "Активности",
  "info_title_9": "Сервисы",
  "info_title_10": "Приемники трансляций",
  "info_title_11": "Поставщики контента",
  "info_title_12": "Запрашиваемые разрешения",
  "info_title_13": "Идентификатор пакета",
  "info_title_14": "Версия пакета",
  "info_title_15": "Минимальная версия ОС",
  "info_title_16": "Описание использования камеры",
  "info_title_17": "Описание использования микрофона",
  "info_title_18": "Поддерживаемые платформы",
  "info_title_19": "Семейство устройств",
  "info_title_20": "Требуемые возможности",
  "info_title_21": "Поддерживаемые ориентации",
  "info_title_22": "Поддерживаемые ориентации для iPad",
  "info_title_23": "Дата создания мобильного профиля",
  "info_title_24": "Имя команды",
  "info_title_25": "URL конечных точек",
  "info_title_26": "IP конечных точек",
  "info_tip_1": "Это точки входа для взаимодействия с пользователем. Каждая активность представляет собой один экран с пользовательским интерфейсом.",
  "info_tip_2": "Это компоненты, которые работают в фоновом режиме для выполнения длительных операций или для выполнения задач для удаленных процессов.",
  "info_tip_3": "Это компоненты, которые отвечают на системные широковещательные объявления. Они не отображают пользовательский интерфейс, но могут создавать уведомления на панели состояния.",
  "info_tip_4": "Они управляют набором данных приложения, которые можно хранить в файловой системе, в базе данных SQLite, в Интернете или в любом другом постоянном хранилище, доступном вашему приложению.",
  "info_tip_5": "Это список разрешений, которые запрашивает приложение для доступа к конфиденциальным данным или системным функциям. Примеры включают доступ к камере, контактам, местоположению и т.д.",
  "info_tip_6": "",
  "info_tip_7": "",
  "info_tip_8": "",
  "info_tip_9": "",
  "info_tip_10": "",
  "info_no_data": "Нет данных",
  "not_found": "Эта страница не найдена.",
  "header_nav_4": "Java декомпилятор",
  "java_title": "Java декомпилятор онлайн",
  "java_description": "Оптимизируйте свои Java-приложения с помощью Java декомпилятора онлайн. Анализируйте, декомпилируйте и улучшайте код для повышения производительности и получения инсайтов для лучшего пользовательского опыта и оптимизированной разработки.",
  "java_keywords": "java декомпилятор, java декомпилятор онлайн, apk декомпилятор, декомпилированный apk онлайн, jar декомпилятор онлайн, декомпилятор класса java",
  "java_choose_files": "Выбрать файлы",
  "java_choose_files_more": "или перетащите ваш apk/jar/class сюда",
  "java_faq": "Часто задаваемые вопросы",
  "java_faq_desc": "Найдите ответы на часто задаваемые вопросы ниже",
  "java_faq_title_1": "Как работает Java декомпилятор онлайн?",
  "java_faq_text_1": "Java декомпилятор онлайн упрощает процесс - просто перетащите и отпустите свои файлы классов Java для мгновенной декомпиляции. Ожидайте высококачественных результатов без сложностей.",
  "java_faq_title_2": "Процесс декомпиляции безопасен?",
  "java_faq_text_2": "Будьте уверены, Java декомпилятор онлайн придает приоритет вашей конфиденциальности. Файлы временно хранятся для декомпиляции и быстро удаляются, обеспечивая безопасность ваших данных в любое время.",
  "java_faq_title_3": "Какие платформы поддерживает Java декомпилятор?",
  "java_faq_text_3": "Java декомпилятор онлайн работает на всех платформах, включая Mac, Linux, Ubuntu и различные версии Windows. Наслаждайтесь безпроблемной декомпиляцией независимо от вашей операционной системы.",
  "java_faq_title_4": "Процесс декомпиляции прост в использовании?",
  "java_faq_text_4": "Java декомпилятор онлайн предлагает самый простой опыт декомпиляции Java в Интернете, устраняя любую кривую обучения. Наслаждайтесь легкой декомпиляцией всего несколькими щелчками.",
  "java_faq_title_5": "Требуется ли установка для процесса декомпиляции?",
  "java_faq_text_5": "Установка не требуется. Java декомпилятор онлайн использует облачные технологии для быстрой декомпиляции, обеспечивая беспроблемный опыт без локальных установок.",
  "java_faq_title_6": "Могу ли я быстро извлечь содержимое Jar, используя эту платформу?",
  "java_faq_text_6": "Абсолютно. Функция извлечения Jar в Java декомпиляторе онлайн использует облачные технологии для быстрой извлечения. Наслаждайтесь быстрой и эффективной экстракцией содержимого Jar без необходимости дополнительных установок.",
  "java_notice": "Из-за размера файла процесс загрузки может занять от 3 до 5 минут. Спасибо за ваше терпение."
}